import React, { useCallback, useState } from 'react'
import Text from '../atoms/text'
import TabStepZero from './tab-step-zero';
import TabStepOne from './tab-step-one';
import ButtonGeneral from '../atoms/button';
import usePostRegister from '../db/use-post-register';
import Input from '../atoms/input';
import Logo from '../assets/image/iranishop favicon.png'
import GeneralModal from './modal-general';


function FormSign() {
    const [address, setAddress] = useState('');
    const [isCheckedSoq, setIsCheckedSoq] = useState(false);
    const [isChecked, setIsChecked] = useState(false);
    const [numberPass, setNumberPass] = useState('');
    const [phone, setPhone] = useState('');
    const [internationalNumber, setInternationalNumber] = useState('');
    const [loginRule, setLoginRule] = useState(null);
    const [err, setErr] = useState(null);
    const [valueName, setValueName] = useState('');
    const [nameCompony, setNameCompony] = useState('');
    const [valueFamily, setValueFamily] = useState('');
    const [postalCode, setPostalCode] = useState('');
    const [open, setOpen] = useState(false);
    const [openّIraniShop, setOpenIraniShop] = useState(false);

    const {mutate , isPending} = usePostRegister();

    const [step, setStep] = useState(0);
    const [stepCode, setStepCode] = useState(2);
    const [activeTab, setActiveTab] = useState(0);

    const handleTabClick = (tab) => {
        setActiveTab(tab);
    };

    const handlePostRegister = (e) => {
        e.preventDefault();

        if (phone.length !== 12) {
            setErr({message: 'این فیلد اشتباه است'})
        }
        if (!isCheckedSoq || !isCheckedSoq) {
            setLoginRule({ message: 'لطفا با قوانین و قرارداد موافقت کنید.' });
            return;
        }
        
        mutate(
            {
                address,numberPass,phone,internationalNumber,valueName, nameCompony, valueFamily, activeTab, postalCode
            },
            {
                onSuccess: (data) => {
                    setStepCode(3)
                    // queryClient.removeQueries('allRider');
                }
            }
        )
    };


    return (
        <div>
            <div className='max-w-[600px] m-auto mt-4 px-4'>
                <div className='flex justify-center items-center gap-2'>
                    <Text className={`text-center py-8`}>پنل ثبت نام فروشندگان ایرانی شاپ</Text>
                    <img src={Logo} className='w-9 h-9'/>
                </div>
               <div className="w-max m-auto flex">
                    <div
                        className={`px-12 py-3 rounded-tr-xl rounded-br-xl cursor-pointer transition-all duration-100 ${
                            activeTab === 0
                            ? 'bg-gradient-to-r from-blue-500/80 to-blue-400/100 backdrop-blur-md text-white shadow-lg shadow-blue-300/50 border-blue-400/50'
                            : 'bg-gray-100 text-black border-gray-300'
                        }`}
                        onClick={() => {
                            handleTabClick(0);
                            setStep(0)
                        }}
                    >
                        <Text>حقیقی</Text>
                    </div>
                    <div
                        className={`px-12 py-3 rounded-tl-xl rounded-bl-xl cursor-pointer transition-all duration-100 ${
                            activeTab === 1
                            ? 'bg-gradient-to-r from-blue-500/80 to-blue-400/100 backdrop-blur-md text-white shadow-lg shadow-blue-300/50 border-blue-400/50'
                            : 'bg-gray-100 text-black border-gray-300'
                        }`}
                        onClick={() => {
                            handleTabClick(1);
                            setStep(1)
                        }}
                    >
                        <Text>حقوقی</Text>
                    </div>
                </div>

                <form action=""> 
                    {stepCode === 2 && (  
                        <>
                        {step === 0 && (
                            <TabStepZero 
                                err={err}
                                address={address}
                                setAddress={setAddress}

                                numberPass={numberPass}
                                setNumberPass={setNumberPass}

                                phone={phone}
                                setPhone={setPhone}

                                internationalNumber={internationalNumber}
                                setInternationalNumber={setInternationalNumber}

                                valueName={valueName}
                                setValueName={setValueName}

                                valueFamily={valueFamily}
                                setValueFamily={setValueFamily}

                                postalCode={postalCode}
                                setPostalCode={setPostalCode}
                                />
                        )}
                        {step === 1 && (
                            <TabStepOne
                                err={err}
                                address={address}
                                setAddress={setAddress}

                                numberPass={numberPass}
                                setNumberPass={setNumberPass}

                                phone={phone}
                                setPhone={setPhone}

                                internationalNumber={internationalNumber}
                                setInternationalNumber={setInternationalNumber}

                                valueName={valueName}
                                setValueName={setValueName}

                                nameCompony={nameCompony}
                                setNameCompony={setNameCompony}

                                postalCode={postalCode}
                                setPostalCode={setPostalCode}
                            />
                        )}

                        <div className='flex gap-2'>
                            <input checked={isCheckedSoq} onChange={(e) => setIsCheckedSoq(e.target.checked)} type="checkbox" name="" id="" />
                            <Text><span className='text-customBlue cursor-pointer' onClick={() => setOpen(true)}>قوانین</span> ثبت نام در سوق المفتوح از طریق ایرانی شاپ</Text>
                        </div>
                        <div className='flex mt-2 gap-2'>
                            <input checked={isChecked} onChange={(e) => setIsChecked(e.target.checked)} type="checkbox" name="" id="" />
                            <Text><span className='text-customBlue cursor-pointer' onClick={() => setOpenIraniShop(true)}>قرارداد</span> ایرانی شاپ</Text>
                        </div>

                        {loginRule ? <Text className={`mt-4 text-red-500`}>{loginRule.message}</Text> : ''}

                        <ButtonGeneral onClick={handlePostRegister}>
                            {isPending ? 'درحال ارسال ' : " ارسال" }
                        </ButtonGeneral>
                        </>
                    )}

                    {stepCode === 3 && (  
                        <div className=' w-full mt-6 flex justify-center'>
                            <Text className={`!text-green-500`}>ثبت نام انجام شد</Text>
                        </div>
                    )}
                </form>
            </div>
            {/* soq almaftuh */}
            <GeneralModal
                open={open}
                handleClose={(e) => {
                    e.preventDefault();
                    setOpen(false)
                }}
                title="قرارداد ثبت نام در سوق المفتوح از طریق ایرانی شاپ"
                // content="این یک مودال عمومی است که در تمام بخش‌ها می‌توان از آن استفاده کرد."
                actionText="بله"
                exitButton={`بازگشت`}
                classAccept={`hidden`}
                actionHandler={(e) => { 
                    e.preventDefault();
                    // handleExit()
                }}
                onClose={()=> setOpen(false)}
                sx={{
                    width: '90%', 
                    '@media (max-width: 840px)': {
                        width: '92%',
                    },
                    // height: '90%'
                }}
                classChildren={`h-[550px] overflow-scroll`}
            >
                <Text className={`text-right`}>
                ماده 1 – تعاریف:

بازار آنلاین: بازار آنلاین بازاری است که در آن کالا در بستر اینترنت و به‌صورت برخط (آنلاین)، عرضه می شود و به فروش میرسد.
بازار آفلاین: بازار آفلاین بازاری است که در آن، کالا مستقل از اینترنت و به‌ صورت سنتی در فروشگاه‌ها و مراکز توزیع، عرضه می شود و به فروش میرسد.
تامین کننده به کاربری اطلاق می‌شود که هرگونه محتوای کاربری را با هدف فروش یا ارائه هرگونه کالا یا خدماتی به خریداران، توسط ایرانی شاپ در پلتفرم سوق المفتوح بارگذاری می‌کند.
خریدار به کاربری اطلاق می‌شود که پلتفرم را مرور می‌کند و به دنبال هر محصول یا خدماتی در پلتفرم می‌گردد، و با قصد خرید هر محصول یا خدماتی که توسط تامین کننده دیگری ارائه می‌شود، با او ارتباط برقرار می‌کند.
سوق المفتوح یا Opensooq : سوق المفتوح پلتفرمی است که خریدار و تامین کننده را برای فروش کالا یا خدمات خود به هم ارتباط میدهد و هیچ گونه نقل و انتقال مالی در سایت انجام نمی شود و خریدار و تامین کننده پس از مذاکره باهم و حتی چانه زنی های مرسوم به یک قیمت میرسند و خریدار وجه را به تامین کننده پرداخت و محصول را تحویل میگیرد و هیچ گونه مسئولیتی در قبال نقل و انتقال بر عهده سوق المفتوح نمی باشد(مشابه سایت ایرانی دیوار) و در این قرارداد ایرانی شاپ محصول را از تامین کننده ایرانی دریافت و بعد انجام کلیه امور مرتبط به سایت سوق المفتوح، در سایت سوق المفتوح قرار میدهد و بفروش میرساند و پس از کسر هزینه های جاری اعم از  هزینه های مربوط به ثبت آگهی در سوق المفتوح، مالیات، هزینه ارسال محصول به خریدار در عمان، درصد ایرانی شاپ و سایر هزینه ها، مبلغ حاصل از فروش را به تامین کننده در ایران پرداخت می نماید.
کالای معیوب: عبارت است از هر گونه کالا یا هر بخش یا جزیی از آن که دارای ایراد، نقص، صدمه و یا دارای گارانتی غیر معتبر یا حسب مورد فاقد گارانتی، گواهی، مجوز، پروانه هایی که قانونا جهت فروش آن کالا الزامی است، باشد.
کالای تقلبی یا غیراصل: کالاهای ذیل، کالای تقلبی یا غیراصل محسوب می شوند:
کالایی که با برند یا مدل اصلی آن کالا از نظر نام متشابه اما از نظر اصالت متفاوت است؛ و یا هرگونه کالایی که از نظر جعبه، بسته‌بندی، جنس، کیفیت و غیره با کالای اصلی که توسط مراکز مورد تایید مانند (سایت اصلی برند) که کالاهای اصل را به ‌فروش می‌رسانند مغایرت داشته و همچنین در سایت ایرانی شاپ در عنوان یا تصاویر کالای نمایش داده شده، برند اصلی کالا ذکر شده ولی کالای فروخته شده با نمونه‌ی اصلی کالا مغایرت داشته، کالای مورد نظر غیر اصل شناخته می شود.
کالاهایی که در آنها شماره سریال، مدل، برچسب یا سایر نشان های شناسایی و یا مشخصات کالا، قطعات و اجزای آنها و یا بستهبندی یا هرگونه نوشته ای در روی آنها بطور غیرمجاز از جانب تولیدکننده، توزیعکننده یا تامین کننده کالا و یا هر شخص دیگر، محو، تغییر، جایگزین و یا به هر شکلی دستکاری شده باشند.
کالاهای مغایر با مقررات قوانین و مقررات و ضوابط و استانداردهای دولتی،عمومی و صنفی به ویژه مقررات بهداشتی.
کالاهای ناقض حقوق اشخاص ثالث از جمله حقوق مالکیت فکری
کالای قاچاق: کالایی است که دارای مدارک و مستندات رسمی قابل ارائه دال بر ورود و ترخیص آن از مبادی قانونی و گمرک رسمی کشور نبوده یا هر کالایی که وفق قوانین و مقررات جاری کشور قاچاق محسوب شود. 
درگاه اینترنتی: وب سایت ایرانی شاپ به آدرس www.iranishop.om  می باشد.
قرارداد همکاری: قرارداد منعقده بین ایرانی شاپ و تامین کننده محصول برای ثبت محصول تامین کننده در سایت سوق المفتوح عمان، بر اساس شرایط همکاری حاضر و به شرح پیوست است.
تبصره 1: ایرانی شاپ یک بازار آنلاین (بازار الکترونیکی)است که نقش آن ایجاد زیرساخت مناسب برای تعامل میان تأمین‌کنندگان و مصرف‌کنندگان خارجی محصول (کالا) در چارچوب قوانین و قواعد این قرارداد است. به عبارت دیگر، ایرانی شاپ  به شکل یک واسطه میان تامین کنندگان کالا  و خریداران کالا در سایت سوق المفتوح عمان فعالیت می‌کند و بدلیل آن‌که طرفین معامله در دو کشور متفاوت هستند و ارتباط برای طرفین معامله مقدور نیست، ایرانی شاپ این نقش را ایفا می کند و مسئولیت ثبت محصول تامین کنندگان و فروش و تحویل آن در عمان به خریدار و تحویل مبلغ حاصل از فروش محصول با کسر هزینه های حمل، مالیات و درصد کمیسیون ایرانی شاپ و سایر هزینه ها به تامین کننده محصول را دارد.
ثبت محصول، مطابق با مطالب، عکس و محتوای بارگذاری شده در سایت ایرانی شاپ، در سایت سوق المفتوح قرار می گیرد، در صورت نیاز به تغییر، تامین کننده حتما باید قبل از ثبت محصول در سوق المفتوح آن را به اطلاع نماینده ایرانی شاپ در سوق المفتوح برساند.
قیمت محصول با محاسبه هزینه های مرتبط با هر محصول، تحقیق بازار، قیمت سنجی در عمان با تایید نماینده ایرانی شاپ در سایت سوق المفتوح بارگذاری می گردد و تامین کننده حق هیچ گونه اعتراض نسبت به قیمت تعیین شده در سوق المفتوح ندارد. 

ماده 2 – طرفین قرارداد:

طرف اول قرارداد: این قرارداد بر اساس ماده ۱۰ قانون مدنی و به صورت دوجانبه و مطابق مفاد و شرایط این سند، میان طرفین آن منعقد می‌شود: طرف اول قرارداد پلتفرم بازار الکترونیکی ایرانی شاپ به نشانی اینترنتی www.iranishop.om و تمامی سرویس‌ها، ابزارها، اپلیکیشن‌ها و سایر وب‌سایت‌ها و دامنه‌ها و نشان‌های تجاری وابسته به آن و پل ارتباطی تامین کننده کالا با سوق المفتوح است که از این پس در این سند « ایرانی شاپ »‌ نامیده می‌شود.
تبصره 2: ایرانی شاپ یک بازار آنلاین (بازار الکترونیکی)است که نقش آن ایجاد زیرساخت مناسب برای تعامل میان تأمین‌کنندگان و مصرف‌کنندگان عمانی و سایر کشورهای عربی محصول (کالا) در چارچوب قوانین و قواعد این قرارداد است. به عبارت دیگر، ایرانی شاپ  به شکل یک واسطه میان تامین کننده کالا و خریداران سایت سوق المفتوح عمان فعالیت می‌کند و بدلیل آن‌که طرفین معامله در دو کشور متفاوت هستند و ارتباط برای طرفین معامله مقدور نیست ایرانی شاپ این نقش را ایفا می کند.
طرف دوم قرارداد : شخص یا اشخاصی که با امضای قرارداد همکاری و ثبت نام در ایرانی شاپ به شرح پیوست نسبت به فروش محصولات و کالاهای خود از طریق درگاه اینترنتی ایرانی شاپ www.iranishop.om  جهت ثبت در سوق المفتوح در اختیار ایرانی شاپ قرار میگیرد که از این پس « تامین کننده » نامیده می شوند.
ماده 3 – موضوع  قرارداد:
استفاده از خدمات ایرانی شاپ جهت ثبت محصول در سایت سوق المفتوح عمان در چارچوب این سند، قوانین و مقررات کشور ایران و کشور عمان، احکام شرعی و اخلاق و عرف جامعه شامل موارد ذیل می‌گردد:
تامین محصول از طرف تامین کننده و تحویل محصول به انبار ایرانی شاپ در شهر مسقط عمان (از طریق کارگزاری حمل و نقل کاردوجین و یا هر کارگزاری یا شخص دیگر) جهت ثبت محصول، مذاکره با خریدار در عمان، فروش و دریافت مبلغ محصول و تحویل مبلغ آن با کسر هزینه های حمل، مالیات و درصد کمیسیون ایرانی شاپ و سایر هزینه ها به تشخیص ایرانی شاپ و سایر هزینه های اداری در کشور عمان به تامین کننده محصول.
ماده 4 – نحوه اجرای قرارداد همکاری:

ایرانی شاپ و سوق المفتوح حق دارند هر زمان و به صلاحدید خود دسترسی به پنل را مسدود و یا محصول خاصی را از سایت سوق المفتوح حذف نمایند.
هرگاه تامین کننده محصول مرتکب تخلف از مواردی که در قرارداد ذکر گردیده شوند ایرانی شاپ بدون کسب اجازه از تامین کننده حق حذف محصول از سوق المفتوح را دارد و تامین کننده حق هر گونه اعتراضی را از خود سلب می نماید.
پس از ثبت محصول توسط ایرانی شاپ در سوق المفتوح ، تامین کننده حق هیچگونه تغییر در مطالب اگهی ندارد، پس قبل از ثبت محصول در سوق المفتوح لطفا تمامی الزامات را مسئول مربوطه در ایرانی شاپ هماهنگ بفرمایید.
سوق المفتوح حق دارد هرگونه شرایط را در سایت خود تغییر یا اصلاح نماید و این هیچ حقی را برای تامین کننده ایجاد نمی کند و تامین کننده حق اعتراض ندارد و هیچ مسئولیتی بر عهده ایرانی شاپ نمی باشد.
طبق قوانین و شرایط سوق المفتوح خریدار تا 7 روز فرصت عودت یا تعویض کالا به هر دلیل اعم از معیوب بودن کالا، منطبق نبودن کالا با محتوای قرار داده شده در سایت، مخدوش بودن یا شکسته بودن و هر دلیل دیگر را دارد. تامین کننده حق هیچگونه اعتراض نسبت به این موضوع ندارد و ایرانی شاپ حق دارد از کالای باقی مانده از همان محصول در انبار نسبت به تعویض یا عودت کالا اقدام نماید.
سفارشات خرید مشتری، با توجه به موجودی اختصاص داده شده توسط تامین کننده در پنل فروشندگان ، برای وی قابل‌رؤیت است و تامین کننده موظف است سفارشات ثبت شده را با توجه به ضوابط و زمان تعیین شده در پنل خود، به‌صورت محموله آماده، در لفاف مناسبی بسته‌بندی کرده و به انبار ایرانی شاپ واقع در مسقط عمان یا از طریق حمل و نقل از طریق شرکت حمل معرفی شده از طرف ایرانی شاپ (کاردوجین) و یا از طریق شرکت های حمل و نقل دیگر در صورت تایید ایرانی شاپ در پنل به انبار ایرانی شاپ در مسقط تحویل نماید.
نشانی انبار ایرانی شاپ به تامین کننده اعلام خواهد شد و در صورتیکه نشانی اعلام شده تغییر یابد ایرانی شاپ به تامین کننده اعلام خواهد کرد و تامین کننده مکلف به تبعیت از تغییرات بعدی است.
نگهداری کالای مشتریان در انبار ایرانی شاپ به صورت امانی بوده و غیر از تعدی یا تفریط، مسئولیتی متوجه ایرانی شاپ نمی باشد. هزینه نگهداری وفق جدول نگهداری مندرج در پنل محاسبه و از تامین کننده دریافت می شود. ایرانی شاپ میتواند کلیه مطالبات خود ناشی از این بند یا سایر مفاد این شرایط همکاری را راساً از محل مطالبات تامین کننده کسر نماید. در هر صورت، حق مطالبه مابقی و یا کلیه ی هزینه ها و مطالبات ایرانی شاپ از طریق مراجع قضایی برای ایرانی شاپ وجود دارد.
این قرارداد همکاری حق انحصاری جهت فروش برای تامین کننده ایجاد نمی نماید و هیچ گونه اعتراضی نسبت به فروش کالا و نیز بهای کالاهای در حال فروش توسط فروشندگان دیگر، قابل استماع نمی باشد. 
وجه ناشی از فروش کالا توسط خریدار به حساب ایرانی شاپ واریز میشود و مسئولیت صدور فاکتور فروش و سند برگشت از فروش برای مشتری بر عهده ایرانی شاپ است که ایرانی شاپ مطابق رای دفتر فنی، برای کالای فروش رفته به نیابت از تامین کننده ، فاکتور فروش موضوع را صادر و برای مشتری ارسال می نماید و نیز صورت‌حساب خدمات ارائه شده از سوی ایرانی شاپ به تامین کننده، توسط ایرانی شاپ به نام تامین کننده صادر می‌شود. 
با امضای این قرارداد تامین کننده به ایرانی شاپ وکالت می دهد که جهت رضایتمندی خریداران، نیابتا از طرف تامین کننده ، اقدام به صدور فاکتور در خصوص اقلامی که توسط تامین کننده ، در فضای سوق المفتوح به فروش می رسد، نماید. در صورت هرگونه مناقشه بر روی محصول فروخته شده، تامین کننده موظف به تعهد به حضور و پاسخگویی در مراجع اداری و قضایی بوده و همچنین ضامن جبران خسارات وارده به اشخاص ثالث و ایرانی شاپ می باشد و ایرانی شاپ در خصوص موارد فوق فاقد هرگونه مسئولیتی می باشد. 
قیمت درج شده در سوق المفتوح بر اساس قیمت اعلامی تامین کننده به اضافه هزینه های برآوردی می باشد و پس از ثبت محصول در سوق المفتوح تامین کننده حق هیچگونه اعتراض را از خود سلب نموده و موظف است کالای مورد نظر را با همان قیمت ثبت شده تحویل ایرانی شاپ بدهد.
تامین کننده اظهار مینماید که با عرضه کالا در پنل اختصاصی خود در درگاه اینترنتی سوق المفتوح ، حقوق مالکیت فکری یا سایر حقوق و امتیازات مکتسبه متعلق به هیچ شخص حقیقی و حقوقی دیگری را نقض نکرده است و در صورت کشف خلاف این موضوع، کلیه مسئولیت های حقوقی و کیفری بر عهده وی خواهد بود و کلیه خسارات وارده به ایرانی شاپ یا اشخاص ثالث در این خصوص به عهده تامین کننده می باشد.
قیمت اعلام شده از طرف تامین کننده به ایرانی شاپ تا زمانی که تعداد موجود در انبار یا تعداد اعلامی تامین کننده در سایت به اتمام نرسیده قابل تغییر نیست و تامین کننده تنها پس از اتمام موجودی در انبار یا موجودی اعلام شده در سایت قادر به تغییر قیمت خواهد بود.
در مورد سفارش های مدت دار و سفارش هایی که بعد از فروش به مشتری به انبار ایرانی شاپ ارسال می گردد، تامین کننده موظف است ظرف 24 ساعت محصول را به کارگزاری حمل و نقل ( کاردوجین ) تحویل نماید. و کاردوجین یا کارگزار حمل موظف است ظرف مدت 7 روز محصول را به انبار ایرانی شاپ در مسقط تحویل نماید.
هزینه حمل محصول از ایران (تمامی شهرها) تا تحویل به انبار ایرانی شاپ در مسقط به عهده تامین کننده می باشد و تامین کننده موظف است هزینه حمل را به کارگزاری حمل (کاردوجین) پرداخت نماید و قبل از درج قیمت نهایی، حتما تمامی هزینه های حمل و سود خود را محاسبه نماید و بعدا اقدام به ثبت سفارش و درج قیمت در سایت اقدام نماید، بدیهی است هرگونه اشتباه در ثبت قیمت و محصول به عهده تامین کننده می باشد و پس از ثبت محصول امکان حذف وجود ندارد مگر در شرایط خاص که با همکاری نماینده ایرانی شاپ انجام خواهد گردید.
ارسال محصولات به دو روش هوایی و دریایی صورت می گیرد، که در صورت فورس بودن ارسال و حجم کم محصول معمولا از روش هوایی استفاده می گردد. و در صورتی که حجم محصول زیاد باشد و عجله ای در ارسال آن وجود نداشته باشد محصول توسط کارگزاری حمل به روش دریایی ارسال می گردد.
محصولات تامین کننده بصورت امانی در اختیار ایرانی شاپ قرار خواهد گرفت و در صورت فروش مبلغ آن به حساب کاربری تامین کننده افزوده خواهد شد. اگر چنانچه کالاها ظرف مدت 3 ماه بفروش نرسد و در انبار ایرانی شاپ موجود باشد طبق توافق طرفین در مورد استرداد و یا ادامه فروش تصمیم گیری خواهد شد.
در مورد کالاهایی که تاریخ مصرف دارند و تاریخ مصرف آنها به اتمام برسد، ایرانی شاپ موظف به معدوم یا استرداد کالا با هماهنگی تامین کننده می باشد که هزینه حمل نیز به عهده تامین کننده می باشد.

ماده 5 – کمیسیون وهزینه های فروش:

کمیسیون ایرانی شاپ: درصدی از بهای فروش کالا است که بابت عرضه کالا در درگاه اینترنتی سوق المفتوح و به شرح مندرج در جدول کمیسیون‌ها در پنل فروشندگان به ایرانی شاپ  تعلق می گیرد. نظر به اینکه درصد مذکور پیش از درج کالا در پنل برای تامین کننده قابل رویت است، تامین کننده با ثبت و یا درج کالا در پنل فروشندگان، درصد مذکور را نیز به عنوان حق الزحمه و کمسیون ایرانی شاپ تائید می کند و می پذیرد. ایرانی شاپ می‌تواند نسبت به وصول کمیسیون خود از محل مطالبات تامین کننده به همراه مالیات متعلقه اقدام نماید. 
هزینه‌های جانبی مربوط به خدمات تبلیغاتی، تولید محتوا و تصویربرداری برای کالا، استفاده از پنل مخصوص مشتریان، هزینه‌های مرجوعی، همچنین جریمه‌ها (بر اساس ضوابط کاری ایرانی شاپ به شرح مندرج در این شرایط همکاری و نیز ضوابط مندرج در پنل فروشندگان) و هزینه‌های جانبی مربوط به همه مراحل بسته‌بندی، ارسال کالا به انبار ایرانی شاپ  (از قبیل بیمه، حمل و سایر هزینه‌های مربوطه)، انبار داری و ارسال کالا برای مشتری (بر اساس ضوابط کاری ایرانی شاپ)، به شرح مندرج در جدول هزینه ها به همراه مالیات متعلقه به عهده تامین کننده بوده و از تامین کننده دریافت خواهد شد. 
تبصره 3: امکان تغییر کمیسیون، هزینه ها و جریمه ها در هر زمان توسط ایرانی شاپ در پنل فروشندگان وجود دارد و تامین کننده قادر به مشاهده سوابق تغییرات آن خواهد بود. تغییرات در کمیسیون، هزینه ها و جریمه ها دو روز قبل از اعمال به اطلاع تامین کننده در پنل فروشندگان خواهد رسید و ادامه روند فروش توسط تامین کننده پس از اعمال تغییرات به منزله پذیرش شرایط جدید است و درحکم اصلاحیه قرارداد همکاری است که خود به خود با ادامه روند فروش مورد توافق طرفین قرار گرفته است و نیاز به تشریفات امضا و ابلاغ جداگانه ای برای لازم الاجرا بودن ندارد.
تبصره 4: تامین کننده متعهد شد جهت آگاهی از هرگونه تغییرات، هر روز پنل فروشندگان خود را مشاهده کند و ایرانی شاپ هیچگونه مسئولیتی نسبت به ادعای عدم آگاهی تامین کننده از تغییرات نداشته و تامین کننده ملزم به تبعیت از تغییرات است. هرگونه اصلاحیه یا الحاقیه یا تغییر از جمله تغییرات در هزینه ها و جریمه ها، در پنل تامین کننده قرار خواهد گرفت و همزمان از طریق پست الکترونیک تامین کننده به نشانی مندرج در پنل ارسال خواهد شد. تغییرات فوق ظرف دو روز از تاریخ ارسال پست الکترونیک و تغییرات پنل لازم الاجرا خواهد بود مگر اینکه تامین کننده ظرف مهلت مذکور، عدم موافقت خود را اعلام نموده باشد ، که در اینصورت قرارداد همکاری فسخ خواهد شد. 
ماده 6 – تعهدات و حقوق تامین کننده:

تامین کننده متعهد است مدارک درخواست شده در خصوص احراز هویت و مدارک موثق و معتبر ثبتی و نیز گواهینامههای صنفی، حرفه ای، بهداشتی (در صورت لزوم)، استاندارد و سایر مدارک مورد نیاز از سوی کشور عمان (در صورت نیاز) به شرح پنل فروشندگان را بارگذاری و در صورت لزوم آنها را به روزرسانی نماید، عدم بارگذاری یا به روزرسانی اسناد به طور صحیح علاوه بر ایجاد حق فسخ برای ایرانی شاپ (پس از اخطار رفع نقص) این حق را برای ایرانی شاپ ایجاد میکند که کلیه پرداخت ها را تا زمان رفع نواقص مدارک معلق و دسترسی تامین کننده را به پنل فروشندگان قطع نماید. 
تامین کننده حقیقی میتواند همزمان با انعقاد قرارداد همکاری ، شخصی را به عنوان نماینده خود جهت ارتباط و هماهنگی با ایرانی شاپ معرفی نمايد.
تامین کننده حقوقی موظف است همزمان با انعقاد قرارداد همکاری، شخصی را به عنوان نماینده خود جهت ارتباط و هماهنگی با ایرانی شاپ معرفی نمايد.
تامین کننده متعهد به رعایت تمامی اصول و مقررات قانون رقابت و شرایط خاص صنفی مرتبط با فعالیت خود می باشد. 
تامین کننده موظف است مشخصات محصولات و توضیحات لازم جهت معرفی کالا، نحوه پشتیبانی پس از فروش و سایر موارد لازم را در درگاه اینترنتی ایرانی شاپ براساس شرایط اعلامی ایرانی شاپ جهت ارائه در سوق المفتوح ارائه نماید. تامین کننده مسئولیت صحت اطلاعات و تضمین اصالت و کیفیت خدمات را شخصاً بر عهده دارد و بدین وسیله متعهد گردید در قبال تخلفات خود علاوه بر حضور در مراجع رسمی و پاسخگویی، مسئولیت تمامی هزینه های هرگونه دعوای طرح شده توسط ثالث به عهده تامین کننده می باشد.
تامین کننده متعهد میشود که کالاهای مورد درخواست مشتری را بدون وقفه و در موعد مقرر ارسال نماید، و به هیچ دلیلی اعم از نوسانات نرخ ارز، عدم موجودی، اشتباه در مشخصات و غیره از تحویل آن استنکاف نورزد. در غیر این صورت ایرانی شاپ می‌تواند بنا به تشخیص خود، خسارات ناشی از تأخیر در اجرای تعهدات را از تامین کننده مطالبه و یا از محل مطالبات وی کسر و برداشت نماید. علاوه بر این ایرانی شاپ می‌تواند اقدام به قطع همکاری کند. قطع همکاری نافی حقوق قراردادی ایرانی شاپ درخصوص محاسبه و کسر جرائم و تاخیرات از محل مطالبات و تضامین تامین کننده نمیباشد.
در صورتیکه برخی از کالاها پس از ثبت خرید خریدار از ایران ارسال می گردد، تامین کننده موظف است بلافاصله پس از ثبت درخواست مشتری ظرف 24 ساعت کالای خود را تحویل کاردوجین بنماید و کاردوجین موظف است ظرف مدت 7 روز آن را به انبار ایرانی شاپ در مسقط تحویل نماید. 
از آنجا که طبق مقررات قانون تجارت الکترونیک، تامین کننده متعهد به رعایت مهلت هفت روزه جهت انصراف مشتری و استرداد کالا میباشد، تامین کننده با پذیرش تعهدات ناشی از مقررات موصوف و سایر مقررات مربوط به این نوع تجارت، متعهد میباشد کالاهای مرجوعی را بپذیرد. مسئولیت هرگونه تخلف از این مقررات با تامین کننده بوده و تامین کننده متعهد به پاسخگویی به دعاوی میباشد. حتی اگر مشتریان به هر دلیل دعاوی خود را در خصوص عدم رعایت موازین قانونی علیه ایرانی شاپ طرح کنند و تحت هر شرایطی ایرانی شاپ  به دلیل عملکرد مرتبط با تامین کننده منفرداً یا متضامناً محکوم گردید، تامین کننده موظف است علاوه بر حضور در مراجع رسمی و پاسخگویی، ایرانی شاپ را درخصوص موضوعات قضائی و هزینهها و خسارات آن مصون نماید و این هزینهها را مسترد نماید. 
تامین کننده در صورت اعلام مشتری مبنی بر عیب، کاستی یا نقص کالا، متعهد به اجرای صحیح تعهدات و پاسخگویی به مشتری و جلب رضایت وی بر اساس نظر ایرانی شاپ است و در صورت درخواست مشتری نسبت به جایگزین کردن یا رفع نقص آن، ظرف مدت 2 روز کاری اقدام نماید. چنانچه تامین کننده ظرف مدت مذکور اقدام لازم را معمول نداشته یا مشتری با پس دادن کالا ( در صورت موجود بودن کالا در انبار ایرانی شاپ، ایرانی شاپ حق دارد کالای مرجوعی را به تشخیص خود معاوضه نماید) تقاضای استرداد وجه را داشته باشد، ایرانی شاپ نسبت به عودت وجه به مشتری اقدام می نماید و تامین کننده بدینوسیله حق هرگونه اعتراض نسبت به استرداد وجه به مشتری و عدم استرداد کالا از سوی خریدار را از خود سلب و ساقط مینماید. تامین کننده میپذیرد هزینه ناشی از استرداد کالاهای معیوب یا ناقص توسط مشتری، از مطالبات تامین کننده کسر و توسط ایرانی شاپ برداشت خواهد شد. 
تامین کننده اعلام و اقرار می نماید مالک قانونی کالاهای معرفی‌شده بوده و مجاز به فروش آنها است و ضمناً کالاهای ارائه شده را از مجاری و طرق قانونی تأمین کرده و دارای فاکتور خرید معتبر می باشد و متعهد می‌شود هیچ‌گونه کالای قاچاق، ممنوعه یا غیر بهداشتی یا مضر برای سلامتی یا تاریخ گذشته یا بدون تاریخ و مجوز را را تحویل مشتری ندهد و تضمین می‌کند تمامی کالاها و ملحقات فروخته و ارسال‌شده به نحو صحیح و قانونی قیمتگذاری و با رعایت حقوق مالکیت فکری عرضه شده و جزء کالاهای مجاز و قانونی و بهداشتی باشد و در غیر این صورت کلیه مسئولیت‌های قضایی و قانونی و پاسخگویی به مشتری و سایر اشخاص و مراجع ذی صلاح و نه منحصراً شامل گمرکات، تعزیرات و اداره مالیات بر عهده تامین کننده خواهد بود و تامین کننده موظف است درصورت محکومیت یا الزام قانونی ایرانی شاپ به پرداخت خسارت یا جریمه، علاوه بر پرداخت آنها، جریمه ای به عنوان وجه التزام عدم انجام تعهد نیز به ایرانی شاپ  پرداخت نماید. تامین کننده ضمن تضمین موارد فوق، بدینوسیله میپذیرد که در صورت تخلف، ایرانی شاپ  میتواند ضمن قطع فوری دسترسی تامین کننده به پنل، نسبت به فسخ قرارداد همکاری اقدام نماید و تامین کننده حق هرگونه اعتراضی را از خود سلب و ساقط می نماید. 
تامین کننده متعهد می‌شود که هیچ‌گونه کالای تقلبی یا غیراصل را به عنوان کالای اصل در سایت درج نکرده و تحویل مشتری ندهد. در غیر این صورت تامین کننده موظف است، وجه التزام عدم انجام تعهد به ایرانی شاپ را پرداخت نماید، در غیر این صورت، ایرانی شاپ میتواند ضمن قطع فوری دسترسی تامین کننده به پنل، نسبت به فسخ قرارداد همکاری اقدام نماید و تامین کننده بدینوسیله حق هرگونه اعتراضی را از خود سلب و ساقط می نماید.
تامین کننده تضمین میکند که اولاً تنوع، تعداد، قیمت، کیفیت، مشخصات و عملکرد معمول کالاها به ترتیب اعلام شده در درگاه اینترنتی ایرانی شاپ می باشد و کالاها با اطلاعات انتشار یافته در مورد آن‌ها کاملاً تطبیق دارد، ثانیاً کلیه کالاها در بسته‌بندی مطابق با استاندارد ایرانی شاپ (و در صورت فقدان استاندارد خاصی از سوی ایرانی شاپ، در بهترین بسته‌بندی معمول در رویه تجاری برای آن نوع کالا و مسیر حمل) تحویل داده خواهد شد، ثالثاً، کالاهای فروخته شده به هیچ عنوان کالاهای دست دوم (ریپک یا غیرآکبند)، مرجوعی (ریفرش) و یا مجددا فروخته شده نمی باشد. تامین کننده مسئول جبران خسارات وارده و دعوای طرح شده از سوی مشتریان در خصوص موارد مذکور در این بند خواهد بود و مسئولیتی در این خصوص متوجه ایرانی شاپ نخواهد بود.
تامین کننده متعهد است نظر ایرانی شاپ را در مورد کاستی‌ها و نقایص بستهها پذیرفته و اقدامات لازم را در خصوص رفع نقص ظرف مدت 48 ساعت به عمل آورد. در صورت عدم رفع نقص، تامین کننده متعهد به جبران خسارات وارده به ایرانی شاپ و مشتری حسب اعلام ایرانی شاپ و پرداخت خسارات ناشی از تأخیر در انجام تعهد است.
تامین کننده ملزم است کلیه هزینه ها و عوارض و مالیات محصول را چه در کشور مبدا (ایران) و چه در کشور مقصد (عمان) طبق تعرفه های اعلام شده از طرف ایرانی شاپ و سایر هزینه ها ( هزینه حمل و مالیات و غیره) در قیمت نهایی محصول خود اعمال نماید، و ایرانی شاپ هیچ گونه مسئولیتی در قبال قیمت پایین و یا حتی قیمت نهایی محصول با ضرر ندارد و ایرانی شاپ اجازه دارد محصول مورد نظر را که در سایت بارگذاری شده است را به فروش برساند. 
تامین کننده موظف است در خصوص کالاهای ملزم به داشتن گارانتی، کالا را با گارانتی مجاز در پنل عرضه نماید. تاریخ شروع گارانتی از زمان صدور فاکتور توسط ایرانی شاپ آغاز می‌شود و تامین کننده موظف است اعتبار گارانتی را از زمان فروش کالا محاسبه کند. در غیر اینصورت مسئولیت پاسخگویی به ادعاهای اشخاص ثالث (اعم از مشتری و سایر اشخاص و مراجع) را بر عهده دارد.
تامین کننده اعلام و اظهار می دارد كه در زمان انعقاد قرارداد همکاری، مشمول هیچ ممنوعيت قانونی برای انعقاد قرارداد همکاری نمیباشد و چنانچه در هر زمانی به هر دلیلی مشمول ممنوعیت قرار گرفت، متعهد به اعلام ممنوعیت قانونی خود جهت اخذ تصمیم مقتضی به ایرانی شاپ می باشد. در صورت عدم اعلام ممنوعیت، تامین کننده مسئول عواقب قانونی آن و جبران خسارات وارده به اشخاص ثالث و ایرانی شاپ  خواهد بود و ایرانی شاپ هیچ مسئولیتی نداشته و نخواهد داشت. 
اگر در جریان تحویل، قبول، استفاده یا دسترسی به کالاها، خسارت مالی یا آسیب و جراحات شخصی ناشی از تقصیر یا عدم مراقبت در تولید، بسته‌بندی یا تحویل کالا رخ دهد از جمله مواردی چون استاندارد پایین، معیوب یا مضر بودن اجزای تشکیل‌دهنده ی کالا، آلودگی کالا یا هرگونه قصور و تقصیر از ناحیه تامین کننده، تامین کننده در مقابل ایرانی شاپ، کارکنان و نمایندگان وی و خریدار و اشخاص ثالث مسئول جبران کلیه خسارات وارده خواهد بود. 
مسئولیت کلیه هزینه ها و مراحل قضایی مربوط به کالاهای خوراکی و مواد غذایی فاسد یا فاقد استاندارد که موجب خسارت به خریدار و یا موجب زیان های پزشکی که به خریدار وارد گردیده است، به عهده تامین کننده می باشد و تامین کننده موظف به پرداخت هزینه ها و حضور در مراجع قضایی برای پاسخگویی می باشد.
تامین کننده متعهد است صرفاً کالاهای موجود در انبار را در پنل فروشندگان اعلام نماید. معرفی کالای غیر موجود در پنل فروشندگان به عنوان کالای موجود ممنوع بوده و تامین کننده مسئول جبران خسارات وارده به ایرانی شاپ و مشتری و پاسخگویی حقوقی و کیفری در مقابل مراجع قضایی و قانونی خواهد بود. در این حالت ایرانی شاپ بنا به تشخیص خود علاوه بر اخذ وجه التزام قراردادی راساً نسبت به قطع پنل تامین کننده به فوریت اقدام خواهد نمود. 
تامین کننده حق تغییر قیمت تعداد کالایی را که در سایت ایرانی شاپ ثبت نموده است ندارد و با همان قیمت درج شده در سایت بفروش میرسد و تا پایان اتمام موجودی کالا در انبار ایرانی شاپ یا انبار تامین کننده که در سایت ایرانی شاپ اعلام موجودی نموده اعمال تغییر قیمت وجود ندارد.
تامین کننده متعهد به حفظ محرمانگی نام کاربری و رمز عبور پنل فروشندگان بوده و برای جلوگیری از هرگونه سوء استفاده احتمالی، کلیه اقدامات لازم از جمله تغییر رمز عبور در دورههای متعارف و عدم افشای آن به اشخاص ثالث را مبذول خواهد داشت. بدیهی است مسئولیت هرگونه سهل انگاری در حفظ نام کاربری و رمز عبور، مسئولیتهای ناشی از استفاده از رمز عبور و به طور کل، کلیه ی فعالیتهایی که تحت حساب کاربری و یا رمز عبور انجام میپذیرد بر عهده تامین کننده میباشد. در صورت بروز هر گونه مشکل یا تخلف یا سوء استفاده اشخاص ثالث، تامین کننده مسئول و پاسخگوی نهادها و مراجع ذیربط و جبران هرگونه خسارت احتمالی وارده است و باید در اسرع وقت نسبت به تغییر رمز عبور اقدام نماید. تامین کننده موظف است هرگونه مشکل احتمالی را سریعاً به ایرانی شاپ اعلام نماید و جهت حل و فصل آن همکاری لازم را داشته باشد. در غیر اینصورت مسئولیت هرگونه سوء استفاده از پنل یا خسارات ناشی از آن بر عهده تامین کننده است.
تامین کننده متعهد است مقررات لازم‌الاجرا علی‌الخصوص قانون تجارت الکترونیک و نظامات مختص این قانون (از جمله ارائه کالاهای سالم به مشتری، حفظ مهلت هفت روزه انصراف، ارائه اطلاعات دقیق و جامع در مورد کالای عرضه ‌شده در فضای مجازی) و قوانین و مقررات مالیاتی، صنفی، جرائم رایانه‌ای و مجازات اسلامی و نیز قوانین و مقررات تعزیرات و امور گمرکی و صادرات و واردات و مبارزه با قاچاق را رعایت نماید و همچنین تأیید می نماید که مجوزهای قانونی و توانایی های لازم را برای این فعالیت ها دارا می باشد. تامین کننده ضمن آگاهی به این موضوع حق خود در خصوص هرگونه ادعای جبران خسارات را سلب و ساقط می نماید.
در صورت نیاز به تاریخ مصرف برای برخی از محصولات، تامین کننده موظف است تاریخ مصرف بر روی کالا را حتما به سال میلادی ثبت نماید.
تامین کننده موظف است در درج محتوای کالا در پنل خود، کلیه ی مقررات و شئون اخلاقی، اسلامی و قانونی را رعایت نموده و بدینوسیله مسئولیت هرگونه پاسخگویی در این خصوص به مراجع ذی صلاح یا اشخاص ثالث را میپذیرد. 
در صورت تخلف از هر یک از تعهدات مندرج در این شرایط همکاری ، تامین کننده باید خسارات وارده به ایرانی شاپ را جبران نماید و با امضای قرارداد همکاری می پذیرد، در صورت بروز تخلف و عدم رعایت مفاد این شرایط همکاری، ایرانی شاپ میتواند به تشخیص خود راساً نسبت به قطع پنل اقدام نماید. 
مطالبات تامین کننده خواه ناشی از این شرایط همکاری، خواه ناشی از هر منشا دیگر، نزد ایرانی شاپ از جمله تضامین میباشد و ایرانی شاپ میتواند هر یک از مطالبات خویش، هزینه ها و خسارات را راسا از محل مطالبات وی یا هر یک از تضامین نزد خود وصول نماید. 
تامین کننده موظف است کالاهای خود را با برچسب گذاری صحیح تحویل ایرانی شاپ نماید. درصورتیکه کالا بدون برچسب مذکور، به انبار ایرانی شاپ ارسال شود، کالا دریافت نخواهد شد و به هزینه تامین کننده عودت می گردد چنانچه کالا توسط شخصی به غیر از تامین کننده (پست/پیک)، بدون برچسب گذاری صحیح و مشخص بودن نام و نشانی تامین کننده به هر علت به انبار ایرانی شاپ، وارد شود، ایرانی شاپ مسئولیتی درقبال این نوع کالاهای بدون مشخصات و برچسب صحیح نخواهد داشت. پس از اعلام به تامین کننده در صورت قابل شناسایی بودن، تامین کننده موظف است کالاهای مذکور را به هزینه خود استرداد نماید و تا حداکثر 48 ساعت پس از اعلام ایرانی شاپ، کالای جدید با برچسب گذاری صحیح را به انبار ایرانی شاپ ارسال نماید.
لازم بذکر است در فاز اول برچسب گذاری به عهده کاردوجین می باشد و تامین کننده مسئولیتی در این خصوص ندارد


تامین کننده موظف است نسبت به کالاهای عودت شده از سوی مشتریان، کالاهای معیوب، کالاهایی که در اثنای همکاری فروش آن ها ممنوع و غیر قانونی شده است یا به هر علت موظف به استرداد آن می باشد، اقدامات لازم نسبت به تحویل کالا از انبار ایرانی شاپ (یا از طریق کارگزاری حمل و نقل4 ) را ظرف مدت 7 روز پس از اعلام ایرانی شاپ به ایشان از طریق پنل، انجام دهد. در صورت مراجعه تامین کننده ظرف مهلت مقرر جهت استرداد کالاهای بندهای فوق ابتدا هزینه های انبارداری و خسارات و وجوه التزام، راسا توسط ایرانی شاپ از مطالبات وی کسر و برداشت می شود و سپس کالا به ایشان عودت می گردد. اگر تامین کننده مشمول خدمات ارسال ایرانی شاپ باشد کالا توسط ایرانی شاپ به ایشان ارسال می شود در غیر اینصورت باید شخصا برای دریافت کالا مراجعه نماید. 
در مورد کالاهای گارانتی دار: با توجه به مسافت زیاد(عمان) و عدم امکان تعمیر یا تعویض قطعه، ایرانی شاپ متعهد است در صورتی که خریدار کالایی را مرجوع کرد تعویض نماید و تامین کننده متعهد است کالای مرجوعی را به ایران مسترد نماید (یا در صورت مقرون به صرفه نبودن استرداد، ایرانی شاپ نسبت به معدوم نمودن کالا با هماهنگی با تامین کننده اقدام می نماید و تامین کننده هیچ حقی نسبت به کالای مورد نظر ندارد) قبل از عودت کالا ابتدا هزینه های انبارداری و خسارات و هزینه حمل، وجوه التزام، راسا توسط ایرانی شاپ از مطالبات وی کسر و برداشت می شود و سپس کالا به ایشان عودت می گردد.
در صورت تکرار نقض تعهد به مدت سه بار، ایرانی شاپ می تواند ضمن قطع دسترسی تامین کننده به پنل حسب صلاحدید نسبت به فسخ قرارداد اقدام نماید. فسخ قرارداد مانع از مطالبه وجوه التزام و خسارات نخواهد شد.
در صورتی که تامین کننده جهت دریافت و استرداد کالاهای شرح زیر، اقدام ننماید:
کالاهای بدون برچسب صحیح،
کالاهایی که تامین کننده تقاضای استرداد آن از انبار را نموده است،
کالاهای عودت شده از سوی مشتریان، 
کالاهای معیوب، 
کالاهایی که در اثنای همکاری فروش آن ها ممنوع و غیر قانونی شده است، 
یا به هر علت با توجه به مفاد این قرارداد، موظف به استرداد آن می باشد.
ایرانی شاپ مسئولیتی جهت نگهداری این نوع کالا ها نخواهد داشت و اگر ظرف 14 روز پس از ارسال اخطار به تامین کننده از طریق پنل یا ایمیل مبنی بر تخلیه ی کالاها از انبار ایرانی شاپ، تامین کننده نسبت به استرداد کالاها اقدام ننماید، پرداخت کلیه ی صورتحساب های تامین کننده را متوقف نموده تا زمانی که تامین کننده نسبت به استرداد کالاهای فوق الذکر اقدام نماید. همچنین در صورتی که ظرف 45 روز پس از ارسال اخطار به تامین کننده از طریق پنل یا ایمیل، نسبت به استرداد کالاها اقدام ننماید، ایرانی شاپ عدم استرداد کالاها را به منزله اعراض تامین کننده از کالاهای فوق الذکر تلقی نموده و تامین کننده نیز با تایید این شرایط همکاری و امضای قرارداد همکاری، این اختیار را به  ایرانی شاپ  می دهد تا کالای موجود در انبار را به نفع خود ضبط نموده و مطالبات خود را از محل آن برداشت کند. در این صورت تامین کننده حق هرگونه ادعا و اعتراضی را از خود سلب و ساقط می نماید.
تامین کننده متعهد به معرفی نماینده خود جهت آموزش و توجیه در خصوص نحوه استفاده از درگاه اینترنتی می باشد. متعاقباً تامین کننده با استفاده از پنل، اعلام و اقرار می‌نماید که آموزش‌های لازم را فراگرفته و مسئولیت پنل را برعهده دارد و نمی‌تواند به ادعای ناآگاهی یا عدم اطلاع رسانی، ادعایی را علیه ایرانی شاپ طرح نماید. 

ماده 7 – تعهدات و حقوق ایرانی شاپ:

ایرانی شاپ به‌عنوان واسطه فضای مجازی کسب و کار و خدمات دهنده در خصوص امور جانبی و امین در نگهداری وجوه پرداختی حاصل از فروش، همکاری لازم را با تامین کننده در راستای عرضه کالاهای موضوع قرارداد در درگاه اینترنتی (معرفی، توصیف و عکس گذاری، ارسال آنها به مشتریان بالقوه و سایر خدمات به شرح مقرر در پنل تامین کنندگان) با اخذ هزینههای مربوط مبذول خواهد داشت.
طراحی غرفه مربوط به هر کالا، تعیین جایگاه کالا، نحوه معرفی، شیوه نمایش و تبلیغ کالا درصورت درخواست تامین کننده در قبال دریافت هزینه‌های مربوطه به شرح جدول هزینه ها و جریمه ها مندرج در پنل تامین کننده بر عهده ایرانی شاپ خواهد بود.
کلیه مطالب و تصاویر مندرج در درگاه اینترنتی در خصوص محصولات و کالاها، تحت کپی‌رایت و مالکیت فکری ایرانی شاپ است. همچنین هرگونه بهره‌برداری، استناد و استفاده تجاری از آن‌ها، حتی برای مالک کالا، ممنوع بوده و ایرانی شاپ حق خود را برای پیگیری قانونی نقض این موارد محفوظ می‌دارد. عکس‌ها و مطالب تولیدی توسط تامین کننده مشمول این مورد نخواهد شد.
ایرانی شاپ  اقدامات و هماهنگی لازم را جهت آموزش و توجیه تامین کننده یا نمایندگان ایشان در خصوص نحوه استفاده از درگاه اینترنتی انجام خواهد داد و تامین کننده متعهد به حضور در جلسات اجباری می باشد، متعاقباً تامین کننده با استفاده از پنل، اعلام و اقرار مینماید که آموزشهای لازم را فراگرفته و مسئولیت پنل را برعهده دارد و نمیتواند به ادعای ناآگاهی یا عدم اطلاع رسانی، ادعایی را علیه ایرانی شاپ  طرح نماید.
وجوه ناشی از فروش کالا، پس از کسر کمیسیون، هزینه ها و مطالبات قراردادی و تأیید واحد مالی ایرانی شاپ ، طبق زمان بندی مشخص شده در پنل تامین کنندگان به تامین کننده به دو روش زیر بنا به درخواست تامین کننده پرداخت می شود:
الف- واریز ریالی به حساب اعلامی از طرف تامین کننده در ایران
ب- پرداخت دلاری بصورت حضوری در دفتر ایرانی شاپ واقع در تهران
تبصره 5: اگر روز پرداخت مصادف با پنجشنبه باشد، پرداخت در روز بعد اداری یعنی شنبه انجام خواهد شد. اگر روز پرداخت مصادف با جمعه یا تعطیلات رسمی باشد، پرداخت در روز کاری بعدی انجام خواهد شد. 
تبصره 6: کمیسیون، هزینهها و مطالبات قراردادی ایرانی شاپ همراه مالیات کشور عمان محاسبه و از تامین کننده دریافت خواهد شد.
تبصره 7:  تامین کننده موظف به معرفی شماره حساب با کد شبا منطبق با نام خود، به ایرانی شاپ می باشد. وجوه فوق الذکر صرفا به شماره حسابی که کد شبای آن به نام تامین کننده است، واریز خواهد شد. در صورت عدم اعلام تامین کننده و یا عدم تطابق نام تامین کننده و صاحب کد شبا، ایرانی شاپ مسئولیتی در تاخیر و یا عدم پرداخت وجوه، ندارد. 
تبصره 8: تامین کننده مختار است در صورت تمایل وجوه دریافتی خود را بصورت دلاری و در تهران از دفتر ایرانی شاپ دریافت نماید.
تبصره 9: ایرانی شاپ مسئولیت و تعهدی در خصوص تکالیف قانونی و مالیاتی تامین کننده از جمله مالیات بر درآمد کالا ندارد و تامین کننده در صورتیکه مشمول مقررات مالیات باشد، متعهد است در اعلام مبلغ قابل پرداخت توسط مشتری، مالیات بر خود را در نظر گرفته و نسبت به انجام تعهدات مالیاتی و ارائه مدارک و مستندات به حوزه مالیاتی مربوط به خود، اقدامات مقتضی را مبذول نماید. در صورت عدم رعايت هر يك از تعهدات قانونی و مالياتي از سوي تامین کننده، ایرانی شاپ محق می ﺑاشد که خسارات وارده به خود را ﺑر حسب تشخیص خود از محل مطالبات تامین کننده يا تضامین وي راساً و ﺑدون نياز ﺑه مراجعه ﺑه مراجع قانوني وصول نماید.

ایرانی شاپ  در راستای ارائه هرگونه خدمات به تامین کنندگان، هزینه های مربوطه را مطابق با جدول کمیسیون و هزینه ها در ازای صدور فاکتور از تامین کننده دریافت می نماید. فاکتور ایرانی شاپ می تواند به صورت الکترونیک روی پنل باشد و تامین کننده ظرف 5 روز کاری پس از صدور فاکتور مهلت دارد تا مراتب اعتراض خود را اعلام نماید. بدیهی است در صورت اعتراض، موارد توسط ایرانی شاپ بررسی و در صورت صلاحدید در فاکتور بعدی اصلاح می گردد.
ایرانی شاپ  می تواند حقوق و تعهدات خود ناشی از این شرایط همکاری را به اشخاص ثالث منتقل کند. 
ایرانی شاپ حق تغییر «شرایط همکاری» مربوط به سوق المفتوح را در هر زمانی داشته و این تغییرات و همچنین اطلاعیه ها و ابلاغیه ها توسط ایرانی شاپ در پنل اختصاصی تامین کننده اعلام می شود که به منزله ی ابلاغ به «تامین کننده» می باشد. «تامین کنندگان» متعهد هستند تمامی اطلاعیه ها را با دقت مطالعه نموده و طبق آن عمل نمایند. تغییرات به طور خودکار روی پنل اختصاصی تامین کننده قرار گرفته و به منزله ی اصلاحیه و الحاقیه این قرارداد و شرایط همکاری محسوب شده و «تامین کننده» متعهد به رعایت مقررات به روز شده می باشد و نیاز به هیچگونه تشریفات دیگری جهت امضا و ابلاغ نمی باشد.
ماده 8 – وجه التزام: 

درصورتی‌که فروشنده هریک از تعهدات قراردادی خود را در موعد مقرر یا به طور صحیح انجام ندهد یا اقدامات وی به هر دلیل منجر به ورود خدشه به اعتبار یا شهرت ایرانی شاپ گردد، ایرانی شاپ حق دارد وجوه التزام به شرح ذیل را با توجه به جدول موجود در پنل فروشندگان محاسبه و از فروشنده مطالبه یا راساً از مطالبات فروشنده کسر کند: 
الف- وجه التزام قیمت گذاری و فروش هرگونه کالا با قیمتی بالاتر از “قیمت مصرف کننده” مندرج بر روی کالا
ب- وجه التزام فروش کالای غیر اصل و کالای بدون گارانتی
پ- وجه التزام فروش کالای قاچاق، ممنوعه، غیر بهداشتی مضر
ت- وجه التزام لغو سفارش مشتری توسط فروشنده به دلایلی از قبیل عدم موجودی کالا در انبار فروشنده، فروش کالاهای ممنوعه، 
ث- تاخیر در تامین و ارسال کالا از سمت فروشنده، اشتباه در قیمت‌گذاری و سایر دلایل به تشخیص ایرانی شاپ
ج- وجه التزام تاخیر در ارسال کالا (از تاریخ مقرر در پنل برای تحویل به انبار)،
چ- وجه التزام مغایرت کالا و محموله ارسالی با سفارش ثبت شده و محموله ثبت شده در پنل، در هنگام ورود به انبار،
ح- وجه التزام مرجوعی کالا توسط مشتری به دلایلی از قبیل مغایرت محتوایی، معیوب بودن کالا، کالای تقلبی یا غیراصل و سایر دلایل به تشخیص ایرانی شاپ
خ- وجه التزام تاخیر در بازپس گیری و تعیین تکلیف کالا توسط فروشنده به دلایلی از قبیل معیوب بودن، ناقص بودن، مسترد شدن از طرف خریدار یا به هر دلیل به تشخیص ایرانی شاپ مشمول بازپس گیری از انبار شدند.
تبصره 10: وجوه التزام مذکور با الزام فروشنده به انجام تعهد اصلی قابل جمع بوده و بدل آن نمیباشد. 
ماده 9 – خاتمه قرارداد همکاری:
هر يک از طرفين مي‌تواند در صورت انحلال یا ورشکستگی طرف مقابل قرارداد همکاری را فسخ و مراتب را اعلام نماید.
ایرانی شاپ می تواند در موارد زیر، بنا به تشخیص خود و بدون نیاز به مراجعه به مرجع حل و فصل اختلاف، ضمن قطع فوری دسترسی تامین کننده به پنل، قرارداد همکاری را فورا فسخ نماید. فسخ قرارداد همکاری ، مانع از مطالبه خسارات و وجوه التزام از سوی ایرانی شاپ  نمی باشد.
درصورت نقض تعهدات تامین کننده طبق این شرایط همکاری و عدم رفع آن ظرف مدت 10 روز از تاریخ اخطار کتبی الکترونیکی در پنل فروشندگان.
درصورتی که مشخص شود تامین کننده در صدد تطمیع، اغوا یا ارائه هرگونه پیشنهاد نامشروع به هریک از کارکنان ایرانی شاپ بر آمده است.
واگذاری قرارداد به شخص ثالث از سوی تامین کننده. 
علاوه بر موارد مذکور در فوق، ایرانی شاپ می تواند، در صورت عدم تمایل به ادامه همکاری با طرف مقابل، راساً و بدون نیاز به مراجعه به مرجع حل اختلاف در طول مدت قرارداد همکاری ، ضمن قطع فوری پنل، رابطه قراردادی خود با تامین کننده را بدون هرگونه مسئولیت درخصوص پرداخت خسارات تحت هر عنوان، فسخ کند. در این موارد، فروشنده اعلام و اقرار نمود که ایرانی شاپ حق دارد طبق صلاحدید خود عمل نموده و خساراتی تحت هر عنوان، قابل ادعا از سوی تامین کننده نمی باشد.
تبصره 11: در صورت خاتمه قرارداد همکاری ، کالاهای باقی‌مانده در انبار ایرانی شاپ، بعد از تسویه‌حساب، با ارائه صورتحساب و رسید کتبی به تامین کننده مسترد خواهد شد. چنانچه ظرف پنج روز از تاریخ خاتمه قرارداد همکاری ، تامین کننده مطالبات ایرانی شاپ بابت خسارات، وجوه التزام و یا سایر مطالبات را تسویه ننماید، تامین کننده با امضای قرارداد همکاری این اختیار را به ایرانی شاپ می دهد تا کالای موجود در انبار به نفع خود ضبط نموده و مطالبات خود را از محل آن برداشت کند.  

ماده 10 – حوادث غیر مترقبه (فورس ماژور):
چنانچه به دلیل بروز حوادث غیر مترقبه از قبيل جنگ، شورش، سيل، زلزله، حريق و نظایر آن، ايفاي تعهدات از ناحيه يکي از طرفين غیرممکن گردد، قرارداد به حالت تعلیق درآمده و اگر این وضعیت بیش از سه ماه ادامه یابد و طرفین در مورد آن توافقی ننمایند، هر طرف حق فسخ قرارداد همکاری را خواهد داشت.
تبصره 12 : طرف مدعی حوادث غیرمترقبه (فورس ماژور) باید گواهی از مراجع ذیربط اخذ و به طرف مقابل ارائه نماید. 

اسقاط هر یک از حقوق توسط ایرانی شاپ تنها زمانی واجد اثر است که به شکل کتبی به تامین کننده ابلاغ شود. 

ماده 11 – رازداری:
هریک از طرفین باید اطلاعات مندرج در پنل، به ویژه اطلاعات مشتریان را محرمانه تلقی و کلیه اقدامات مقتضی برای تضمین حفظ محرمانگی آن به ‌وسیله کارکنان خود را نیز اتخاذ نمایند. این تعهد تا پنج سال از تاریخ خاتمه قرارداد همکاری معتبر است. بدیهی است ارائه اطلاعات به موجب حکم قانونی یا دستور مقامات، از شمول این ماده مستثنی است. ایرانی شاپ حق دارد به صلاحدید خود خسارات ناشی از نقض این تعهد را محاسبه نموده و از مطالبات فروشنده کسر نماید.

ماده 13 – قانون حاکم و نحوه حل اختلاف
ماده 12 – قانون حاکم و نحوه حل اختلاف:
قرارداد همکاری تابع قوانین جمهوری اسلامی ایران و کشور عمان می باشد و با توجه به محل انعقاد قرارداد، کليه اختلافات و دعاوي ناشي از آن و يا راجع به آن به مراجع صالح قضایی جمهوری اسلامی ایران و یا کشور عمان ارجاع خواهد شد. 
اين شرایط همکاری در 12 ماده و 12 تبصره با امضای قرارداد همکاری مورد تایید قرار می‌گیرد و تامین کننده با امضای قرارداد همکاری متعهد بدان خواهد بود.
                </Text>
            </GeneralModal>
            
            {/* irani shop */}
            <GeneralModal
                open={openّIraniShop}
                handleClose={(e) => {
                    e.preventDefault();
                    setOpenIraniShop(false)
                }}
                title="قرارداد ایرانی شاپ"
                // content="این یک مودال عمومی است که در تمام بخش‌ها می‌توان از آن استفاده کرد."
                actionText="بله"
                exitButton={`بازگشت`}
                classAccept={`hidden`}
                actionHandler={(e) => { 
                    e.preventDefault();
                    // handleExit()
                }}
                onClose={()=> setOpenIraniShop(false)}
                sx={{
                    width: '90%', 
                    '@media (max-width: 840px)': {
                        width: '92%',
                    },
                    // height: '90%'
                }}
                classChildren={`h-[550px] overflow-scroll`}
            >
                <Text className={`text-right`}>
               ماده 1 – تعاریف:

بازار آنلاین: بازار آنلاین بازاری است که در آن کالا در بستر اینترنت و به‌صورت برخط (آنلاین)، عرضه می شود و به فروش میرسد.
بازار آفلاین: بازار آفلاین بازاری است که در آن، کالا مستقل از اینترنت و به‌ صورت سنتی در فروشگاه‌ها و مراکز توزیع، عرضه می شود و به فروش میرسد.
کالای معیوب: عبارت است از هر گونه کالا یا هر بخش یا جزیی از آن که دارای ایراد، نقص، صدمه و یا دارای گارانتی غیر معتبر یا حسب مورد فاقد گارانتی، گواهی، مجوز، پروانه هایی که قانونا جهت فروش آن کالا الزامی است، باشد.
کالای تقلبی یا غیراصل: کالاهای ذیل، کالای تقلبی یا غیراصل محسوب می شوند:
کالایی که با برند یا مدل اصلی آن کالا از نظر نام متشابه اما از نظر اصالت متفاوت است؛ و یا هرگونه کالایی که از نظر جعبه، بسته‌بندی، جنس، کیفیت و غیره با کالای اصلی که توسط مراکز مورد تایید مانند (سایت اصلی برند) که کالاهای اصل را به ‌فروش می‌رسانند مغایرت داشته و همچنین در سایت ایرانی شاپ در عنوان یا تصاویر کالای نمایش داده شده، برند اصلی کالا ذکر شده ولی کالای فروخته شده با نمونه‌ی اصلی کالا مغایرت داشته، کالای مورد نظر غیر اصل شناخته می شود.
کالاهایی که در آنها شماره سریال، مدل، برچسب یا سایر نشان های شناسایی و یا مشخصات کالا، قطعات و اجزای آنها و یا بستهبندی یا هرگونه نوشته ای در روی آنها بطور غیرمجاز از جانب تولیدکننده، توزیعکننده یا فروشنده کالا و یا هر شخص دیگر، محو، تغییر، جایگزین و یا به هر شکلی دستکاری شده باشند.
کالاهای مغایر با مقررات قوانین و مقررات و ضوابط و استانداردهای دولتی،عمومی و صنفی به ویژه مقررات بهداشتی.
کالاهای ناقض حقوق اشخاص ثالث از جمله حقوق مالکیت فکری
کالای قاچاق: کالایی است که دارای مدارک و مستندات رسمی قابل ارائه دال بر ورود و ترخیص آن از مبادی قانونی و گمرک رسمی کشور نبوده یا هر کالایی که وفق قوانین و مقررات جاری کشور قاچاق محسوب شود. 
پنل فروشندگان  (Sellers Panel): فضای مجازی با درگاه اختصاصی هر فروشنده است که از سوی ایرانی شاپ به فروشنده برای عرضه و فروش کالا تخصیص داده می شود. 
درگاه اینترنتی: وب سایت ایرانی شاپ به آدرس www.iranishop.om  می باشد.
قرارداد همکاری: قرارداد منعقده بین ایرانی شاپ و فروشنده ، بر اساس شرایط همکاری حاضر و به شرح پیوست است.
تبصره 1: ایرانی شاپ یک بازار آنلاین (بازار الکترونیکی)است که نقش آن ایجاد زیرساخت مناسب برای تعامل میان تأمین‌کنندگان و مصرف‌کنندگان خارجی محصول (کالا) در چارچوب قوانین و قواعد این قرارداد است. به عبارت دیگر، ایرانی شاپ  به شکل یک واسطه میان مشتریان و عرضه‌کنندگان کالا فعالیت می‌کند و بدلیل آن‌که طرفین معامله در دو کشور متفاوت هستند و ارتباط برای طرفین معامله مقدور نیست ایرانی شاپ این نقش را ایفا می کند.
ماده 2 – طرفین قرارداد:

طرف اول قرارداد: این قرارداد بر اساس ماده ۱۰ قانون مدنی و به صورت دوجانبه و مطابق مفاد و شرایط این سند، میان طرفین آن منعقد می‌شود: طرف اول قرارداد پلتفرم بازار الکترونیکی ایرانی شاپ به نشانی اینترنتی www.iranishop.om و تمامی سرویس‌ها، ابزارها، اپلیکیشن‌ها و سایر وب‌سایت‌ها و دامنه‌ها و نشان‌های تجاری وابسته به آن است که از این پس در این سند « ایرانی شاپ »‌ نامیده می‌شود.
تبصره 2: ایرانی شاپ یک بازار آنلاین (بازار الکترونیکی)است که نقش آن ایجاد زیرساخت مناسب برای تعامل میان تأمین‌کنندگان و مصرف‌کنندگان خارجی محصول (کالا) در چارچوب قوانین و قواعد این قرارداد است. به عبارت دیگر، ایرانی شاپ  به شکل یک واسطه میان مشتریان و عرضه‌کنندگان کالا فعالیت می‌کند و بدلیل آن‌که طرفین معامله در دو کشور متفاوت هستند و ارتباط برای طرفین معامله مقدور نیست ایرانی شاپ این نقش را ایفا می کند.
طرف دوم قرارداد : شخص یا اشخاصی که با امضای قرارداد همکاری و ثبت نام در ایرانی شاپ به شرح پیوست نسبت به فروش محصولات و کالاهای خود از طریق درگاه اینترنتی ایرانی شاپ www.iranishop.om  اقدام می‌نمایند، که از این پس « فروشنده » نامیده می شوند.
ماده 3 – موضوع  قرارداد:
استفاده از خدمات ایرانی شاپ در چارچوب این سند، قوانین و مقررات کشور ایران و کشور عمان، احکام شرعی و اخلاق و عرف جامعه شامل موارد ذیل می‌گردد:
خرید و فروش کالا و خدمات مجاز ایرانی در بستر الکترونیکی، با هدف مصرف، تجارت، بازرگانی، واردات یا صادرات. به کشور عمان و مقاصد دیگر.
برقراری ارتباط و انتشار محتوا در بسترهای اجتماعی ایرانی شاپ در راستای خرید و فروش کالا.
 این قرارداد در دو فاز اجرا خواهد شد:
فاز اول: در فاز اول فروشندگان می توانند با معرفی محصول خود به ایرانی شاپ و بازاریابی توسط ایرانی شاپ بصورت اختصاصی محصول خود را به صورت عمده نیز بفروش برسانند بدون دردسرهای مربوط به صادرات و امور اداری و گمرگی که تماما توسط ایرانی شاپ به انجام میرسد. در این فاز بنا به درخواست فروشنده محصولات از طریق ایرانی شاپ در سایت سوق المفتوح با شرایط و تحت نظر ایرانی شاپ بفروش میرسد.
فاز دوم: در فاز دوم فروشندگان علاوه بر همکاری در فاز یک می توانند محصولات خود را در سایت ایرانی شاپ طبق شرایط قرارداد بفروش برسانند.  در فاز دوم علاوه بر محصولات قبلی مواد غذایی و خوراکی نیز به سایت اضافه می شود.
ماده 4 – نحوه اجرای قرارداد همکاری:

مدت قرارداد متناسب با قرارداد فروش سوق المفتوح می باشد که توصیه می شود تامین کننده محترم قبل از تایید قرارداد .
سفارشات خرید مشتری، با توجه به موجودی اختصاص داده شده توسط فروشنده در پنل فروشندگان ، برای وی قابل‌رؤیت است و فروشنده موظف است سفارشات ثبت شده را با توجه به ضوابط و زمان تعیین شده در پنل خود، به‌صورت محموله آماده، در لفاف مناسبی بسته‌بندی کرده و به انبار ایرانی شاپ واقع در مسقط عمان یا از طریق حمل و نقل از طریق شرکت حمل معرفی شده از طرف ایرانی شاپ (کاردوجین) و یا از طریق شرکت های حمل و نقل دیگر در صورت تایید ایرانی شاپ در پنل به انبار ایرانی شاپ در مسقط تحویل نماید.
نشانی انبار ایرانی شاپ به فروشنده اعلام خواهد شد و در صورتیکه نشانی اعلام شده تغییر یابد ایرانی شاپ به فروشنده اعلام خواهد کرد و فروشنده مکلف به تبعیت از تغییرات بعدی است.
نگهداری کالای مشتریان در انبار ایرانی شاپ به صورت امانی بوده و غیر از تعدی یا تفریط، مسئولیتی متوجه ایرانی شاپ نمی باشد. هزینه نگهداری وفق جدول نگهداری مندرج در پنل محاسبه و از فروشنده دریافت می شود. ایرانی شاپ میتواند کلیه مطالبات خود ناشی از این بند یا سایر مفاد این شرایط همکاری را راساً از محل مطالبات فروشنده کسر نماید. در هر صورت، حق مطالبه مابقی و یا کلیه ی هزینه ها و مطالبات ایرانی شاپ از طریق مراجع قضایی برای ایرانی شاپ وجود دارد.
این قرارداد همکاری حق انحصاری جهت فروش برای فروشندگان ایجاد نمی نماید و هیچ گونه اعتراضی نسبت به فروش کالا و نیز بهای کالاهای در حال فروش توسط فروشندگان دیگر، قابل استماع نمی باشد. 
وجه ناشی از فروش کالا توسط خریدار به حساب ایرانی شاپ واریز میشود و مسئولیت صدور فاکتور فروش و سند برگشت از فروش برای مشتری بر عهده ایرانی شاپ است که ایرانی شاپ مطابق رای دفتر فنی، برای کالای فروش رفته به نیابت از فروشنده ، فاکتور فروش موضوع را صادر و برای مشتری ارسال می نماید و نیز صورت‌حساب خدمات ارائه شده از سوی ایرانی شاپ به فروشنده، توسط ایرانی شاپ به نام فروشنده صادر می‌شود. 
با امضای این قرارداد فروشنده به ایرانی شاپ وکالت می دهد که جهت رضایتمندی خریداران، نیابتا از طرف فروشنده، اقدام به صدور فاکتور در خصوص اقلامی که توسط فروشنده، در فضای مجازی مذکور به فروش می رسد، نماید. لازم به ذکر است که فروشنده کلیه ی مسئولیت های ناشی از صدور فاکتور مذکور و فروش کالا بر روی وبسایت ایرانی شاپ، را بر عهده داشته و در صورت لزوم، متعهد به حضور و پاسخگویی در مراجع اداری و قضایی بوده و همچنین ضامن جبران خسارات وارده به اشخاص ثالث و ایرانی شاپ می باشد و ایرانی شاپ در خصوص موارد فوق فاقد هرگونه مسئولیتی می باشد. 
قیمت کالاها با توجه به رعایت استانداردهای قیمت‌گذاری (با توجه به قوانین و مقرارات از طرف سازمانهای نظارتی کشور عمان و یا لیست قیمت مصوب مورد تایید اتحادیه ها و یا سازمان های مرتبط و همچنین قوانین قیمت گذاری ایرانی شاپ) در پنل فروشندگان ، توسط و به مسئولیت فروشنده تعیین می‌شود. لذا مسئولیت پاسخگویی به مراجع رسمی و اشخاص ثالث از جمله مشتری در خصوص قیمت تعیین شده بر عهده فروشنده است. به موجب این قرارداد، فروشنده به عنوان شرط ضمن عقد اعلام می نمایند که نسبت به فروش کالاهای خود در درگاه اینترنتی ایرانی شاپ کلیه خیارات از جمله غبن ولو فاحش یا افحش را از خود سلب و ساقط نمودند. 
در صورت اشتباه قیمت گذاری از طرف فروشنده و درج قیمت به بهای پایینتر از قیمت واقعی، وی متعهد است کالا را با همان قیمت درج شده تحویل ایرانی شاپ نماید و در صورت استنکاف، مشمول وجه التزام و ضمانت اجرا شامل پرداخت جریمه طبق جدول جریمه ها از حساب فروشنده کسر خواهد شد. درهر حال پاسخگویی به خریدار در مراجع رسمی به عهده فروشنده است. 
فروشنده اظهار مینماید که با عرضه کالا در پنل اختصاصی خود در درگاه اینترنتی ایرانی شاپ ، حقوق مالکیت فکری یا سایر حقوق و امتیازات مکتسبه متعلق به هیچ شخص حقیقی و حقوقی دیگری را نقض نکرده است و در صورت کشف خلاف این موضوع، کلیه مسئولیت های حقوقی و کیفری بر عهده وی خواهد بود و کلیه خسارات وارده به ایرانی شاپ یا اشخاص ثالث در این خصوص به عهده فروشنده می باشد.
نام تجاری فروشنده جهت درج در سایت، نام تجاری اعلامی از طرف فروشنده در پنل او میباشد و فروشنده  در این راستا اظهار می نماید مالکیت مادی و معنوی نام تجاری مذکور متعلق به شخص حقیقی و حقوقی دیگری نیست و در صورت کشف خلاف این موضوع، کلیه مسئولیت های حقوقی و کیفری بر عهده فروشنده خواهد بود. در صورتی که فروشنده ظرف مدت 3 روز از اعلام ایرانی شاپ مبنی بر مراجعه جهت پاسخگویی، به مراجع مربوطه مراجعه ننماید، موظف به پرداخت وجه التزام روزانه به ایرانی شاپ می باشد. 
 کالاهایی که در سایت ارائه می گردند حتما باید از جانب تولیدکننده اصلی یا نماینده یا مرکز پخش همان تولیدکننده باشد.
قیمت اعلام شده از طرف فروشنده به ایرانی شاپ تا زمانی که تعداد موجود در انبار یا تعداد اعلامی فروشنده در سایت به اتمام نرسیده قابل تغییر نیست و فروشنده تنها پس از اتمام موجودی در انبار یا موجودی اعلام شده در سایت قادر به تغییر قیمت خواهد بود.
در مورد سفارش های مدت دار و سفارش هایی که بعد از فروش به مشتری به انبار ایرانی شاپ ارسال می گردد، فروشنده موظف است ظرف 24 ساعت محصول را به کارگزاری حمل و نقل ( کاردوجین ) تحویل نماید. و کاردوجین یا کارگزار حمل موظف است ظرف مدت 7 روز محصول را به انبار ایرانی شاپ در مسقط تحویل نماید.
هزینه حمل محصول از ایران (تمامی شهرها) تا تحویل به انبار ایرانی شاپ در مسقط به عهده فروشنده می باشد و فروشنده موظف است هزینه حمل را به کارگزاری حمل (کاردوجین) پرداخت نماید و قبل از درج قیمت نهایی، حتما تمامی هزینه های حمل و سود خود را محاسبه نماید و بعدا اقدام به ثبت سفارش و درج قیمت در سایت اقدام نماید، بدیهی است هرگونه اشتباه در ثبت قیمت و محصول به عهده فروشنده می باشد و پس از ثبت محصول امکان حذف وجود ندارد مگر در شرایط خاص که با همکاری ایرانی شاپ انجام خواهد گردید.
ارسال محصولات به دو روش هوایی و دریایی صورت می گیرد، که در صورت فورس بودن ارسال و حجم کم محصول معمولا از روش هوایی استفاده می گردد. و در صورتی که حجم محصول زیاد باشد و عجله ای در ارسال آن وجود نداشته باشد محصول توسط کارگزاری حمل به روش دریایی ارسال می گردد.
محصولات فروشنده بصورت امانی در اختیار ایرانی شاپ قرار خواهد گرفت و در صورت فروش مبلغ آن به حساب کاربری فروشنده افزوده خواهد شد. اگر چنانچه کالاها ظرف مدت 3 ماه بفروش نرسد و در انبار ایرانی شاپ موجود باشد طبق توافق طرفین در مورد استرداد و یا ادامه فروش تصمیم گیری خواهد شد.
در مورد کالاهایی که تاریخ مصرف دارند و تاریخ مصرف آنها به اتمام برسد، ایرانی شاپ موظف به معدوم یا استرداد کالا با هماهنگی فروشنده می باشد که هزینه حمل نیز به عهده فروشنده می باشد.

ماده 5 – کمیسیون وهزینه های فروش:

کمیسیون ایرانی شاپ: درصدی از بهای فروش کالا است که بابت عرضه کالا در درگاه اینترنتی ایرانی شاپ و به شرح مندرج در جدول کمیسیون‌ها در پنل فروشندگان به ایرانی شاپ  تعلق می گیرد. نظر به اینکه درصد مذکور پیش از درج کالا در پنل برای فروشنده قابل رویت است، فروشنده با ثبت و یا درج کالا در پنل فروشندگان، درصد مذکور را نیز به عنوان حق الزحمه و کمسیون ایرانی شاپ تائید می کند و می پذیرد. ایرانی شاپ می‌تواند نسبت به وصول کمیسیون خود از محل مطالبات فروشنده به همراه مالیات متعلقه اقدام نماید. 
هزینه‌های جانبی مربوط به خدمات تبلیغاتی، تولید محتوا و تصویربرداری برای کالا، استفاده از پنل مخصوص مشتریان، هزینه‌های مرجوعی، همچنین جریمه‌ها (بر اساس ضوابط کاری ایرانی شاپ به شرح مندرج در این شرایط همکاری و نیز ضوابط مندرج در پنل فروشندگان) و هزینه‌های جانبی مربوط به همه مراحل بسته‌بندی، ارسال کالا به انبار ایرانی شاپ  (از قبیل بیمه، حمل و سایر هزینه‌های مربوطه)، انبار داری و ارسال کالا برای مشتری (بر اساس ضوابط کاری ایرانی شاپ)، به شرح مندرج در جدول هزینه ها به همراه مالیات متعلقه به عهده فروشنده بوده و از فروشنده دریافت خواهد شد.  
تبصره 3: امکان تغییر کمیسیون، هزینه ها و جریمه ها در هر زمان توسط ایرانی شاپ در پنل فروشندگان وجود دارد و فروشنده قادر به مشاهده سوابق تغییرات آن خواهد بود. تغییرات در کمیسیون، هزینه ها و جریمه ها دو روز قبل از اعمال به اطلاع فروشنده در پنل فروشندگان خواهد رسید و ادامه روند فروش توسط فروشنده پس از اعمال تغییرات به منزله پذیرش شرایط جدید است و درحکم اصلاحیه قرارداد همکاری است که خود به خود با ادامه روند فروش مورد توافق طرفین قرار گرفته است و نیاز به تشریفات امضا و ابلاغ جداگانه ای برای لازم الاجرا بودن ندارد.
تبصره 4: فروشنده متعهد شد جهت آگاهی از هرگونه تغییرات، هر روز پنل فروشندگان خود را مشاهده کند و ایرانی شاپ هیچگونه مسئولیتی نسبت به ادعای عدم آگاهی فروشنده از تغییرات نداشته و فروشنده ملزم به تبعیت از تغییرات است. هرگونه اصلاحیه یا الحاقیه یا تغییر از جمله تغییرات در هزینه ها و جریمه ها، در پنل فروشنده قرار خواهد گرفت و همزمان از طریق پست الکترونیک فروشنده به نشانی مندرج در پنل ارسال خواهد شد. تغییرات فوق ظرف دو روز از تاریخ ارسال پست الکترونیک و تغییرات پنل لازم الاجرا خواهد بود مگر اینکه فروشنده ظرف مهلت مذکور، عدم موافقت خود را اعلام نموده باشد ، که در اینصورت قرارداد همکاری فسخ خواهد شد. 
ماده 6 – تعهدات و حقوق فروشنده:

فروشنده متعهد است مدارک درخواست شده در خصوص احراز هویت و مدارک موثق و معتبر ثبتی و نیز گواهینامههای صنفی، حرفه ای، بهداشتی (در صورت لزوم)، استاندارد و سایر مدارک مورد نیاز از سوی کشور عمان (در صورت نیاز) به شرح پنل فروشندگان را بارگذاری و در صورت لزوم آنها را به روزرسانی نماید، عدم بارگذاری یا به روزرسانی اسناد به طور صحیح علاوه بر ایجاد حق فسخ برای ایرانی شاپ (پس از اخطار رفع نقص) این حق را برای ایرانی شاپ ایجاد میکند که کلیه پرداخت ها را تا زمان رفع نواقص مدارک معلق و دسترسی فروشنده را به پنل فروشندگان قطع نماید. 
فروشنده حقیقی میتواند همزمان با انعقاد قرارداد همکاری ، شخصی را به عنوان نماینده خود جهت ارتباط و هماهنگی با ایرانی شاپ معرفی نمايد.
فروشنده حقوقی موظف است همزمان با انعقاد قرارداد همکاری، شخصی را به عنوان نماینده خود جهت ارتباط و هماهنگی با ایرانی شاپ معرفی نمايد.
فروشنده متعهد به رعایت تمامی اصول و مقررات قانون رقابت و شرایط خاص صنفی مرتبط با فعالیت خود می باشد. 
فروشنده موظف است مشخصات محصولات و توضیحات لازم جهت معرفی کالا، نحوه پشتیبانی پس از فروش و سایر موارد لازم را در درگاه اینترنتی ایرانی شاپ براساس شرایط اعلامی ایرانی شاپ ارائه نماید. فروشنده مسئولیت صحت اطلاعات و تضمین اصالت و کیفیت خدمات را شخصاً بر عهده دارد و بدین وسیله متعهد گردید در قبال تخلفات خود علاوه بر حضور در مراجع رسمی و پاسخگویی، مسئولیت تمامی هزینه های هرگونه دعوای طرح شده توسط ثالث به عهده فروشنده می باشد.
فروشنده متعهد میشود که کالاهای مورد درخواست مشتری را بدون وقفه و در موعد مقرر ارسال نماید، و به هیچ دلیلی اعم از نوسانات نرخ ارز، عدم موجودی، اشتباه در مشخصات و غیره از تحویل آن استنکاف نورزد. در غیر این صورت ایرانی شاپ می‌تواند بنا به تشخیص خود، خسارات ناشی از تأخیر در اجرای تعهدات را از فروشنده مطالبه و یا از محل مطالبات وی کسر و برداشت نماید. علاوه بر این ایرانی شاپ می‌تواند اقدام به قطع همکاری کند. قطع همکاری نافی حقوق قراردادی ایرانی شاپ درخصوص محاسبه و کسر جرائم و تاخیرات از محل مطالبات و تضامین فروشنده نمیباشد.
فروشنده موظف است ظرف مدت یک روز کالای خریداری شده در سایت را به کارگزاری حمل و نقل تحویل نماید، در غیر اینصورت مشمول جریمه ( طبق جدول جریمه ها ) خواهد شد.
فروشنده در صورت اعلام مشتری مبنی بر عیب، کاستی یا نقص کالا، متعهد به اجرای صحیح تعهدات و پاسخگویی به مشتری و جلب رضایت وی بر اساس نظر ایرانی شاپ است و در صورت درخواست مشتری نسبت به جایگزین کردن یا رفع نقص آن، ظرف مدت 2 روز کاری اقدام نماید. چنانچه فروشنده ظرف مدت مذکور اقدام لازم را معمول نداشته یا مشتری با پس دادن کالا ( در صورت موجود بودن کالا در انبار ایرانی شاپ، ایرانی شاپ حق دارد کالای مرجوعی را به تشخیص خود معاوضه نماید) تقاضای استرداد وجه را داشته باشد، ایرانی شاپ نسبت به عودت وجه به مشتری اقدام می نماید و فروشنده بدینوسیله حق هرگونه اعتراض نسبت به استرداد وجه به مشتری و عدم استرداد کالا از سوی خریدار را از خود سلب و ساقط مینماید. فروشنده میپذیرد هزینه ناشی از استرداد کالاهای معیوب یا ناقص توسط مشتری، از مطالبات فروشنده کسر و توسط ایرانی شاپ برداشت خواهد شد. 
فروشنده اعلام و اقرار می نماید مالک قانونی کالاهای معرفی‌شده بوده و مجاز به فروش آنها است و ضمناً کالاهای ارائه شده را از مجاری و طرق قانونی تأمین کرده و دارای فاکتور خرید معتبر می باشد و متعهد می‌شود هیچ‌گونه کالای قاچاق، ممنوعه یا غیر بهداشتی یا مضر برای سلامتی یا تاریخ گذشته یا بدون تاریخ و مجوز را را تحویل مشتری ندهد و تضمین می‌کند تمامی کالاها و ملحقات فروخته و ارسال‌شده به نحو صحیح و قانونی قیمتگذاری و با رعایت حقوق مالکیت فکری عرضه شده و جزء کالاهای مجاز و قانونی و بهداشتی باشد و در غیر این صورت کلیه مسئولیت‌های قضایی و قانونی و پاسخگویی به مشتری و سایر اشخاص و مراجع ذی صلاح و نه منحصراً شامل گمرکات، تعزیرات و اداره مالیات بر عهده فروشنده خواهد بود و فروشنده موظف است درصورت محکومیت یا الزام قانونی ایرانی شاپ به پرداخت خسارت یا جریمه، علاوه بر پرداخت آنها، جریمه ای به عنوان وجه التزام عدم انجام تعهد نیز به ایرانی شاپ  پرداخت نماید. فروشنده ضمن تضمین موارد فوق، بدینوسیله میپذیرد که در صورت تخلف، ایرانی شاپ  میتواند ضمن قطع فوری دسترسی فروشنده به پنل، نسبت به فسخ قرارداد همکاری اقدام نماید و فروشنده حق هرگونه اعتراضی را از خود سلب و ساقط می نماید. 
فروشنده متعهد می‌شود که هیچ‌گونه کالای تقلبی یا غیراصل را به عنوان کالای اصل در سایت درج نکرده و تحویل مشتری ندهد. در غیر این صورت فروشنده موظف است، وجه التزام عدم انجام تعهد به ایرانی شاپ را پرداخت نماید، در غیر این صورت، ایرانی شاپ میتواند ضمن قطع فوری دسترسی فروشنده به پنل، نسبت به فسخ قرارداد همکاری اقدام نماید و فروشنده بدینوسیله حق هرگونه اعتراضی را از خود سلب و ساقط می نماید.
فروشنده تضمین میکند که اولاً تنوع، تعداد، قیمت، کیفیت، مشخصات و عملکرد معمول کالاها به ترتیب اعلام شده در درگاه اینترنتی ایرانی شاپ می باشد و کالاها با اطلاعات انتشار یافته در مورد آن‌ها کاملاً تطبیق دارد، ثانیاً کلیه کالاها در بسته‌بندی مطابق با استاندارد ایرانی شاپ (و در صورت فقدان استاندارد خاصی از سوی ایرانی شاپ، در بهترین بسته‌بندی معمول در رویه تجاری برای آن نوع کالا و مسیر حمل) تحویل داده خواهد شد، ثالثاً، کالاهای فروخته شده به هیچ عنوان کالاهای دست دوم (ریپک یا غیرآکبند)، مرجوعی (ریفرش) و یا مجددا فروخته شده نمی باشد. فروشنده مسئول جبران خسارات وارده و دعوای طرح شده از سوی مشتریان در خصوص موارد مذکور در این بند خواهد بود و مسئولیتی در این خصوص متوجه ایرانی شاپ نخواهد بود.
فروشنده متعهد است نظر ایرانی شاپ را در مورد کاستی‌ها و نقایص بستهها پذیرفته و اقدامات لازم را در خصوص رفع نقص ظرف مدت 24 ساعت به عمل آورد. در صورت عدم رفع نقص، فروشنده متعهد به جبران خسارات وارده به ایرانی شاپ و مشتری حسب اعلام ایرانی شاپ و پرداخت خسارات ناشی از تأخیر در انجام تعهد است.
فروشنده ملزم است کلیه هزینه ها و عوارض و مالیات محصول را چه در کشور مبدا (ایران) و چه در کشور مقصد (عمان) طبق تعرفه های اعلام شده از طرف ایرانی شاپ و سایر هزینه ها ( هزینه حمل و مالیات و غیره) در قیمت نهایی محصول خود اعمال نماید، و ایرانی شاپ هیچ گونه مسئولیتی در قبال قیمت پایین و یا حتی قیمت نهایی محصول با ضرر ندارد و ایرانی شاپ اجازه دارد محصول مورد نظر را که در سایت بارگذاری شده است را به فروش برساند. 
فروشنده موظف است در خصوص کالاهای ملزم به داشتن گارانتی، کالا را با گارانتی مجاز در پنل عرضه نماید. تاریخ شروع گارانتی از زمان صدور فاکتور توسط ایرانی شاپ آغاز می‌شود و فروشنده موظف است اعتبار گارانتی را از زمان فروش کالا محاسبه کند. در غیر اینصورت مسئولیت پاسخگویی به ادعاهای اشخاص ثالث (اعم از مشتری و سایر اشخاص و مراجع) را بر عهده دارد.
فروشنده اعلام و اظهار می دارد كه در زمان انعقاد قرارداد همکاری، مشمول هیچ ممنوعيت قانونی برای انعقاد قرارداد همکاری نمیباشد و چنانچه در هر زمانی به هر دلیلی مشمول ممنوعیت قرار گرفت، متعهد به اعلام ممنوعیت قانونی خود جهت اخذ تصمیم مقتضی به ایرانی شاپ می باشد. در صورت عدم اعلام ممنوعیت، فروشنده مسئول عواقب قانونی آن و جبران خسارات وارده به اشخاص ثالث و ایرانی شاپ  خواهد بود و ایرانی شاپ هیچ مسئولیتی نداشته و نخواهد داشت. 
اگر در جریان تحویل، قبول، استفاده یا دسترسی به کالاها، خسارت مالی یا آسیب و جراحات شخصی ناشی از تقصیر یا عدم مراقبت در تولید، بسته‌بندی یا تحویل کالا رخ دهد از جمله مواردی چون استاندارد پایین، معیوب یا مضر بودن اجزای تشکیل‌دهنده ی کالا، آلودگی کالا یا هرگونه قصور و تقصیر از ناحیه فروشنده، فروشنده در مقابل ایرانی شاپ، کارکنان و نمایندگان وی و خریدار و اشخاص ثالث مسئول جبران کلیه خسارات وارده خواهد بود. 
مسئولیت کلیه هزینه ها و مراحل قضایی مربوط به کالاهای خوراکی و مواد غذایی فاسد یا فاقد استاندارد که موجب خسارت به خریدار و یا موجب زیان های پزشکی که به خریدار وارد گردیده است، به عهده فروشنده می باشد و فروشنده موظف به پرداخت هزینه ها و حضور در مراجع قضایی برای پاسخگویی می باشد.
فروشنده متعهد است صرفاً کالاهای موجود در انبار را در پنل فروشندگان اعلام نماید. معرفی کالای غیر موجود در پنل فروشندگان به عنوان کالای موجود ممنوع بوده و فروشنده مسئول جبران خسارات وارده به ایرانی شاپ و مشتری و پاسخگویی حقوقی و کیفری در مقابل مراجع قضایی و قانونی خواهد بود. در این حالت ایرانی شاپ بنا به تشخیص خود علاوه بر اخذ وجه التزام قراردادی راساً نسبت به قطع پنل فروشنده به فوریت اقدام خواهد نمود. 
فروشنده حق تغییر قیمت تعداد کالایی را که در سایت ایرانی شاپ ثبت نموده است ندارد و با همان قیمت درج شده در سایت بفروش میرسد و تا پایان اتمام موجودی کالا در انبار ایرانی شاپ یا انبار فروشنده که در سایت ایرانی شاپ اعلام موجودی نموده اعمال تغییر قیمت وجود ندارد.
فروشنده متعهد به حفظ محرمانگی نام کاربری و رمز عبور پنل فروشندگان بوده و برای جلوگیری از هرگونه سوء استفاده احتمالی، کلیه اقدامات لازم از جمله تغییر رمز عبور در دورههای متعارف و عدم افشای آن به اشخاص ثالث را مبذول خواهد داشت. بدیهی است مسئولیت هرگونه سهل انگاری در حفظ نام کاربری و رمز عبور، مسئولیتهای ناشی از استفاده از رمز عبور و به طور کل، کلیه ی فعالیتهایی که تحت حساب کاربری و یا رمز عبور انجام میپذیرد بر عهده فروشنده میباشد. در صورت بروز هر گونه مشکل یا تخلف یا سوء استفاده اشخاص ثالث، فروشنده مسئول و پاسخگوی نهادها و مراجع ذیربط و جبران هرگونه خسارت احتمالی وارده است و باید در اسرع وقت نسبت به تغییر رمز عبور اقدام نماید. فروشنده موظف است هرگونه مشکل احتمالی را سریعاً به ایرانی شاپ اعلام نماید و جهت حل و فصل آن همکاری لازم را داشته باشد. در غیر اینصورت مسئولیت هرگونه سوء استفاده از پنل یا خسارات ناشی از آن بر عهده فروشنده است.
فروشنده متعهد است مقررات لازم‌الاجرا علی‌الخصوص قانون تجارت الکترونیک و نظامات مختص این قانون (از جمله ارائه کالاهای سالم به مشتری، حفظ مهلت هفت روزه انصراف، ارائه اطلاعات دقیق و جامع در مورد کالای عرضه ‌شده در فضای مجازی) و قوانین و مقررات مالیاتی، صنفی، جرائم رایانه‌ای و مجازات اسلامی و نیز قوانین و مقررات تعزیرات و امور گمرکی و صادرات و واردات و مبارزه با قاچاق را رعایت نماید و همچنین تأیید می نماید که مجوزهای قانونی و توانایی های لازم را برای این فعالیت ها دارا می باشد. فروشنده ضمن آگاهی به این موضوع حق خود در خصوص هرگونه ادعای جبران خسارات را سلب و ساقط می نماید.
در صورت نیاز به تاریخ مصرف برای برخی از محصولات، فروشنده موظف است تاریخ مصرف بر روی کالا را حتما به سال میلادی ثبت نماید.
فروشنده موظف است در درج محتوای کالا در پنل خود، کلیه ی مقررات و شئون اخلاقی، اسلامی و قانونی را رعایت نموده و بدینوسیله مسئولیت هرگونه پاسخگویی در این خصوص به مراجع ذی صلاح یا اشخاص ثالث را میپذیرد. 
در صورت تخلف از هر یک از تعهدات مندرج در این شرایط همکاری ، فروشنده باید خسارات وارده به ایرانی شاپ را جبران نماید و با امضای قرارداد همکاری می پذیرد، در صورت بروز تخلف و عدم رعایت مفاد این شرایط همکاری، ایرانی شاپ میتواند به تشخیص خود راساً نسبت به قطع پنل اقدام نماید. 
مطالبات فروشنده خواه ناشی از این شرایط همکاری، خواه ناشی از هر منشا دیگر، نزد ایرانی شاپ از جمله تضامین میباشد و ایرانی شاپ میتواند هر یک از مطالبات خویش، هزینه ها و خسارات را راسا از محل مطالبات وی یا هر یک از تضامین نزد خود وصول نماید. 
فروشنده حق واگذاری جزئی و کلی حقوق و تعهدات خود را به‌ موجب این قرارداد به اشخاص ثالث بدون موافقت کتبی و قبلی طرف دیگر، تحت هیچ عنوانی اعم از نمایندگی، وکالت، صلح حقوق و سایر عناوین، نخواهد داشت. و ایرانی شاپ حق واگذاری را برای خود محفوظ می دارد.
فروشنده موظف است کالاهای خود را با برچسب گذاری صحیح تحویل ایرانی شاپ نماید. درصورتیکه کالا بدون برچسب مذکور، به انبار ایرانی شاپ ارسال شود، کالا دریافت نخواهد شد و به هزینه فروشنده عودت می گردد چنانچه کالا توسط شخصی به غیر از فروشنده (پست/پیک)، بدون برچسب گذاری صحیح و مشخص بودن نام و نشانی فروشنده به هر علت به انبار ایرانی شاپ، وارد شود، ایرانی شاپ مسئولیتی درقبال این نوع کالاهای بدون مشخصات و برچسب صحیح نخواهد داشت. پس از اعلام به فروشنده در صورت قابل شناسایی بودن، فروشنده موظف است کالاهای مذکور را به هزینه خود استرداد نماید و تا حداکثر 24 ساعت پس از اعلام ایرانی شاپ، کالای جدید با برچسب گذاری صحیح را به انبار ایرانی شاپ ارسال نماید.
فروشنده موظف است نسبت به کالاهای عودت شده از سوی مشتریان، کالاهای معیوب، کالاهایی که در اثنای همکاری فروش آن ها ممنوع و غیر قانونی شده است یا به هر علت موظف به استرداد آن می باشد، اقدامات لازم نسبت به تحویل کالا از انبار ایرانی شاپ (یا از طریق کارگزاری حمل و نقل4 ) را ظرف مدت 7 روز پس از اعلام ایرانی شاپ به ایشان از طریق پنل، انجام دهد. در صورت مراجعه فروشنده ظرف مهلت مقرر جهت استرداد کالاهای بندهای فوق ابتدا هزینه های انبارداری و خسارات و وجوه التزام، راسا توسط ایرانی شاپ از مطالبات وی کسر و برداشت می شود و سپس کالا به ایشان عودت می گردد. اگر فروشنده مشمول خدمات ارسال ایرانی شاپ باشد کالا توسط ایرانی شاپ به ایشان ارسال می شود در غیر اینصورت باید شخصا برای دریافت کالا مراجعه نماید. 
در مورد کالاهای گارانتی دار: با توجه به مسافت زیاد(عمان) و عدم امکان تعمیر یا تعویض قطعه، ایرانی شاپ متعهد است در صورتی که خریدار کالایی را مرجوع کرد تعویض نماید و فروشنده متعهد است کالای مرجوعی را به ایران مسترد نماید (یا در صورت مقرون به صرفه نبودن استرداد، ایرانی شاپ نسبت به معدوم نمودن کالا با هماهنگی با فروشنده اقدام می نماید و فروشنده هیچ حقی نسبت به کالای مورد نظر ندارد) قبل از عودت کالا ابتدا هزینه های انبارداری و خسارات و هزینه حمل، وجوه التزام، راسا توسط ایرانی شاپ از مطالبات وی کسر و برداشت می شود و سپس کالا به ایشان عودت می گردد.
در صورت تکرار نقض تعهد به مدت سه بار، ایرانی شاپ می تواند ضمن قطع دسترسی فروشنده به پنل حسب صلاحدید نسبت به فسخ قرارداد اقدام نماید. فسخ قرارداد مانع از مطالبه وجوه التزام و خسارات نخواهد شد.
در صورتی که فروشنده جهت دریافت و استرداد کالاهای شرح زیر، اقدام ننماید:
کالاهای بدون برچسب صحیح،
کالاهایی که فروشنده تقاضای استرداد آن از انبار را نموده است،
کالاهای عودت شده از سوی مشتریان، 
کالاهای معیوب، 
کالاهایی که در اثنای همکاری فروش آن ها ممنوع و غیر قانونی شده است، 
یا به هر علت با توجه به مفاد این قرارداد، موظف به استرداد آن می باشد.
ایرانی شاپ مسئولیتی جهت نگهداری این نوع کالا ها نخواهد داشت و اگر ظرف 14 روز پس از ارسال اخطار به فروشنده از طریق پنل یا ایمیل مبنی بر تخلیه ی کالاها از انبار ایرانی شاپ، فروشنده نسبت به استرداد کالاها اقدام ننماید، پرداخت کلیه ی صورتحساب های فروشنده را متوقف نموده تا زمانی که فروشنده نسبت به استرداد کالاهای فوق الذکر اقدام نماید. همچنین در صورتی که ظرف 45 روز پس از ارسال اخطار به فروشنده از طریق پنل یا ایمیل، نسبت به استرداد کالاها اقدام ننماید، ایرانی شاپ عدم استرداد کالاها را به منزله اعراض فروشنده از کالاهای فوق الذکر تلقی نموده و فروشنده نیز با تایید این شرایط همکاری و امضای قرارداد همکاری، این اختیار را به  ایرانی شاپ  می دهد تا کالای موجود در انبار را به نفع خود ضبط نموده و مطالبات خود را از محل آن برداشت کند. در این صورت فروشنده حق هرگونه ادعا و اعتراضی را از خود سلب و ساقط می نماید.
فروشنده متعهد به معرفی نماینده خود جهت آموزش و توجیه در خصوص نحوه استفاده از درگاه اینترنتی می باشد. متعاقباً فروشنده با استفاده از پنل، اعلام و اقرار می‌نماید که آموزش‌های لازم را فراگرفته و مسئولیت پنل را برعهده دارد و نمی‌تواند به ادعای ناآگاهی یا عدم اطلاع رسانی، ادعایی را علیه ایرانی شاپ طرح نماید. 

ماده 7 – تعهدات و حقوق ایرانی شاپ:

ایرانی شاپ به‌عنوان واسطه فضای مجازی کسب و کار و خدمات دهنده در خصوص امور جانبی و امین در نگهداری وجوه پرداختی حاصل از فروش، همکاری لازم را با فروشنده در راستای عرضه کالاهای موضوع قرارداد در درگاه اینترنتی (معرفی، توصیف و عکس گذاری، ارسال آنها به مشتریان بالقوه و سایر خدمات به شرح مقرر در پنل فروشندگان) با اخذ هزینههای مربوط مبذول خواهد داشت.
طراحی درگاه اینترنتی، تعیین جایگاه کالا، نحوه معرفی، شیوه نمایش و تبلیغ کالا درصورت درخواست فروشنده در قبال دریافت هزینه‌های مربوطه به شرح جدول هزینه ها و جریمه ها مندرج در پنل فروشنده بر عهده ایرانی شاپ خواهد بود.
کلیه مطالب و تصاویر مندرج در درگاه اینترنتی در خصوص محصولات و کالاها، تحت کپی‌رایت و مالکیت فکری ایرانی شاپ است. همچنین هرگونه بهره‌برداری، استناد و استفاده تجاری از آن‌ها، حتی برای مالک کالا، ممنوع بوده و ایرانی شاپ حق خود را برای پیگیری قانونی نقض این موارد محفوظ می‌دارد. عکس‌ها و مطالب تولیدی توسط فروشنده مشمول این مورد نخواهد شد.
ایرانی شاپ  اقدامات و هماهنگی لازم را جهت آموزش و توجیه فروشنده یا نمایندگان ایشان در خصوص نحوه استفاده از درگاه اینترنتی انجام خواهد داد و فروشنده متعهد به حضور در جلسات اجباری می باشد، و فروشنده حق هیچگونه اعتراضی در این خصوص نخواهد داشت. متعاقباً فروشنده با استفاده از پنل، اعلام و اقرار مینماید که آموزشهای لازم را فراگرفته و مسئولیت پنل را برعهده دارد و نمیتواند به ادعای ناآگاهی یا عدم اطلاع رسانی، ادعایی را علیه ایرانی شاپ طرح نماید.
وجوه ناشی از فروش کالا، پس از کسر کمیسیون، هزینه ها و مطالبات قراردادی و تأیید واحد مالی ایرانی شاپ ، طبق زمان بندی مشخص شده در پنل فروشندگان به فروشنده به دو روش زیر بنا به درخواست فروشنده پرداخت می شود:
الف- واریز ریالی به حساب اعلامی از طرف فروشنده در ایران
ب- پرداخت دلاری بصورت حضوری در دفتر ایرانی شاپ واقع در تهران
تبصره 5: اگر روز پرداخت مصادف با پنجشنبه باشد، پرداخت در روز بعد اداری یعنی شنبه انجام خواهد شد. اگر روز پرداخت مصادف با جمعه یا تعطیلات رسمی باشد، پرداخت در روز کاری بعدی انجام خواهد شد. 
تبصره 6: کمیسیون، هزینهها و مطالبات قراردادی ایرانی شاپ همراه مالیات کشور عمان محاسبه و از فروشنده دریافت خواهد شد.
تبصره 7:  فروشنده موظف به معرفی شماره حساب با کد شبا منطبق با نام خود، به ایرانی شاپ می باشد. وجوه فوق الذکر صرفا به شماره حسابی که کد شبای آن به نام فروشنده است، واریز خواهد شد. در صورت عدم اعلام فروشنده و یا عدم تطابق نام فروشنده و صاحب کد شبا، ایرانی شاپ مسئولیتی در تاخیر و یا عدم پرداخت وجوه، ندارد. 
تبصره 8: فروشنده مختار است در صورت تمایل وجوه دریافتی خود را بصورت دلاری و در تهران از دفتر ایرانی شاپ دریافت نماید.
تبصره 9: ایرانی شاپ مسئولیت و تعهدی در خصوص تکالیف قانونی و مالیاتی فروشنده از جمله مالیات بر درآمد کالا ندارد و فروشنده در صورتیکه مشمول مقررات مالیات باشد، متعهد است در اعلام مبلغ قابل پرداخت توسط مشتری، مالیات بر خود را در نظر گرفته و نسبت به انجام تعهدات مالیاتی و ارائه مدارک و مستندات به حوزه مالیاتی مربوط به خود، اقدامات مقتضی را مبذول نماید. در صورت عدم رعايت هر يك از تعهدات قانونی و مالياتي از سوي فروشنده، ایرانی شاپ محق می ﺑاشد که خسارات وارده به خود را ﺑر حسب تشخیص خود از محل مطالبات فروشنده يا تضامین وي راساً و ﺑدون نياز ﺑه مراجعه ﺑه مراجع قانوني وصول نماید.

ایرانی شاپ  در راستای ارائه هرگونه خدمات به فروشندگان، هزینه های مربوطه را مطابق با جدول کمیسیون و هزینه ها در ازای صدور فاکتور از فروشنده دریافت می نماید. فاکتور ایرانی شاپ می تواند به صورت الکترونیک روی پنل باشد و فروشنده ظرف 5 روز کاری پس از صدور فاکتور مهلت دارد تا مراتب اعتراض خود را اعلام نماید. بدیهی است در صورت اعتراض، موارد توسط ایرانی شاپ بررسی و در صورت صلاحدید در فاکتور بعدی اصلاح می گردد.
ایرانی شاپ  می تواند حقوق و تعهدات خود ناشی از این شرایط همکاری را به اشخاص ثالث منتقل کند. 
ایرانی شاپ حق تغییر «شرایط همکاری» را در هر زمانی داشته و این تغییرات و همچنین اطلاعیه ها و ابلاغیه ها توسط ایرانی شاپ در پنل اختصاصی فروشنده اعلام می شود که به منزله ی ابلاغ به «فروشنده» می باشد. «فروشندگان» متعهد هستند تمامی اطلاعیه ها را با دقت مطالعه نموده و طبق آن عمل نمایند. تغییرات به طور خودکار روی پنل اختصاصی فروشنده قرار گرفته و به منزله ی اصلاحیه و الحاقیه این قرارداد و شرایط همکاری محسوب شده و «فروشنده» متعهد به رعایت مقررات به روز شده می باشد و نیاز به هیچگونه تشریفات دیگری جهت امضا و ابلاغ نمی باشد.
ماده 8 – وجه التزام: 

درصورتی‌که فروشنده هریک از تعهدات قراردادی خود را در موعد مقرر یا به طور صحیح انجام ندهد یا اقدامات وی به هر دلیل منجر به ورود خدشه به اعتبار یا شهرت ایرانی شاپ گردد، ایرانی شاپ حق دارد وجوه التزام به شرح ذیل را با توجه به جدول موجود در پنل فروشندگان محاسبه و از فروشنده مطالبه یا راساً از مطالبات فروشنده کسر کند: 
الف- وجه التزام قیمت گذاری و فروش هرگونه کالا با قیمتی بالاتر از “قیمت مصرف کننده” مندرج بر روی کالا
ب- وجه التزام فروش کالای غیر اصل و کالای بدون گارانتی
پ- وجه التزام فروش کالای قاچاق، ممنوعه، غیر بهداشتی مضر
ت- وجه التزام لغو سفارش مشتری توسط فروشنده به دلایلی از قبیل عدم موجودی کالا در انبار فروشنده، فروش کالاهای ممنوعه، 
ث- تاخیر در تامین و ارسال کالا از سمت فروشنده، اشتباه در قیمت‌گذاری و سایر دلایل به تشخیص ایرانی شاپ
ج- وجه التزام تاخیر در ارسال کالا (از تاریخ مقرر در پنل برای تحویل به انبار)،
چ- وجه التزام مغایرت کالا و محموله ارسالی با سفارش ثبت شده و محموله ثبت شده در پنل، در هنگام ورود به انبار،
ح- وجه التزام مرجوعی کالا توسط مشتری به دلایلی از قبیل مغایرت محتوایی، معیوب بودن کالا، کالای تقلبی یا غیراصل و سایر دلایل به تشخیص ایرانی شاپ
خ- وجه التزام تاخیر در بازپس گیری و تعیین تکلیف کالا توسط فروشنده به دلایلی از قبیل معیوب بودن، ناقص بودن، مسترد شدن از طرف خریدار یا به هر دلیل به تشخیص ایرانی شاپ مشمول بازپس گیری از انبار شدند.
تبصره 10: وجوه التزام مذکور با الزام فروشنده به انجام تعهد اصلی قابل جمع بوده و بدل آن نمیباشد. 
ماده 9 – خاتمه قرارداد همکاری:
هر يک از طرفين مي‌تواند در صورت انحلال یا ورشکستگی طرف مقابل قرارداد همکاری را فسخ و مراتب را اعلام نماید.
ایرانی شاپ می تواند در موارد زیر، بنا به تشخیص خود و بدون نیاز به مراجعه به مرجع حل و فصل اختلاف، ضمن قطع فوری دسترسی فروشنده به پنل، قرارداد همکاری را فورا فسخ نماید. فسخ قرارداد همکاری ، مانع از مطالبه خسارات و وجوه التزام از سوی ایرانی شاپ  نمی باشد.
درصورت نقض تعهدات فروشنده طبق این شرایط همکاری و عدم رفع آن ظرف مدت 10 روز از تاریخ اخطار کتبی الکترونیکی در پنل فروشندگان.
درصورتی که مشخص شود فروشنده در صدد تطمیع، اغوا یا ارائه هرگونه پیشنهاد نامشروع به هریک از کارکنان ایرانی شاپ بر آمده است.
واگذاری قرارداد به شخص ثالث از سوی فروشنده. 
علاوه بر موارد مذکور در فوق، ایرانی شاپ می تواند، در صورت عدم تمایل به ادامه همکاری با طرف مقابل، راساً و بدون نیاز به مراجعه به مرجع حل اختلاف در طول مدت قرارداد همکاری ، ضمن قطع فوری پنل، رابطه قراردادی خود با فروشنده را بدون هرگونه مسئولیت درخصوص پرداخت خسارات تحت هر عنوان، فسخ کند. در این موارد، فروشنده اعلام و اقرار نمود که ایرانی شاپ حق دارد طبق صلاحدید خود عمل نموده و خساراتی تحت هر عنوان، قابل ادعا از سوی فروشنده نمی باشد.
تبصره 11: در صورت خاتمه قرارداد همکاری ، کالاهای باقی‌مانده در انبار ایرانی شاپ، بعد از تسویه‌حساب، با ارائه صورتحساب و رسید کتبی به فروشنده مسترد خواهد شد. چنانچه ظرف پنج روز از تاریخ خاتمه قرارداد همکاری ، فروشنده مطالبات ایرانی شاپ بابت خسارات، وجوه التزام و یا سایر مطالبات را تسویه ننماید، فروشنده با امضای قرارداد همکاری این اختیار را به ایرانی شاپ می دهد تا کالای موجود در انبار به نفع خود ضبط نموده و مطالبات خود را از محل آن برداشت کند.  

ماده 10 – حوادث غیر مترقبه (فورس ماژور):
چنانچه به دلیل بروز حوادث غیر مترقبه از قبيل جنگ، شورش، سيل، زلزله، حريق و نظایر آن، ايفاي تعهدات از ناحيه يکي از طرفين غیرممکن گردد، قرارداد به حالت تعلیق درآمده و اگر این وضعیت بیش از سه ماه ادامه یابد و طرفین در مورد آن توافقی ننمایند، هر طرف حق فسخ قرارداد همکاری را خواهد داشت.
تبصره 12 : طرف مدعی حوادث غیرمترقبه (فورس ماژور) باید گواهی از مراجع ذیربط اخذ و به طرف مقابل ارائه نماید. 

ماده 11 – رازداری:
هریک از طرفین باید اطلاعات مندرج در پنل، به ویژه اطلاعات مشتریان را محرمانه تلقی و کلیه اقدامات مقتضی برای تضمین حفظ محرمانگی آن به ‌وسیله کارکنان خود را نیز اتخاذ نمایند. این تعهد تا پنج سال از تاریخ خاتمه قرارداد همکاری معتبر است. بدیهی است ارائه اطلاعات به موجب حکم قانونی یا دستور مقامات، از شمول این ماده مستثنی است. ایرانی شاپ حق دارد به صلاحدید خود خسارات ناشی از نقض این تعهد را محاسبه نموده و از مطالبات فروشنده کسر نماید.

ماده 12 – قانون حاکم و نحوه حل اختلاف:
قرارداد همکاری تابع قوانین جمهوری اسلامی ایران و کشور عمان می باشد و با توجه به محل انعقاد قرارداد، کليه اختلافات و دعاوي ناشي از آن و يا راجع به آن به مراجع صالح قضایی جمهوری اسلامی ایران و یا کشور عمان ارجاع خواهد شد. 
اين شرایط همکاری در 12 ماده و 12 تبصره با امضای قرارداد همکاری مورد تایید قرار می‌گیرد و فروشنده با امضای قرارداد همکاری متعهد بدان خواهد بود.
                </Text>
            </GeneralModal>
        </div>
    )
}

export default FormSign
